{reviewerID='A1N4O8VOJZTDVB', asin='B004A9SDD8', reviewerName='Annette Yancey', helpful=[1, 1], reviewText='Loves the song, so he really couldn't wait to play this. A little less interesting for him so he doesn't play long, but he is almost 3 and likes to play the older games, but really cute for a younger child.', overall=3.0, summary='Really cute', unixReviewTime=1383350400, reviewTime='11 2, 2013'}
{reviewerID='APYOBQE6M18AA', asin='0615391206', reviewerName='Martin Schwartz', helpful=[0, 0], reviewText='My daughter wanted this book and the price on Amazon was the best.  She has already tried one recipe a day after receiving the book.  She seems happy with it.', overall=5.0, summary='Best Price', unixReviewTime=1382140800, reviewTime='10 19, 2013'}
{reviewerID='A1JVQTAGHYOL7F', asin='0615391206', reviewerName='Michelle Dinh', helpful=[0, 0], reviewText='I bought this zoku quick pop for my daughterr with her zoku quick maker. She loves it and have fun to make her own ice cream.', overall=5.0, summary='zoku', unixReviewTime=1403049600, reviewTime='06 18, 2014'}
{reviewerID='AFOFZDTX5UC6D', asin='B004A9SDD8', reviewerName='C. Galindo', helpful=[1, 1], reviewText='There are three different versions of the song. The game itself keeps her occupied as everything she clicks on does something! There is an airplane that flies around the room, a telephone that rings and is plays a message, the lamp turns off the light and you see the monkeys eyes going up and down in the dark, a dog that barks when you click the window and then chases a cat out from under the bed every third time, the picture on the wall becomes an interactive portrait, the traffic light stops/starts the monkeys jumping, alarm clock rings, plant grows (and produces bananas), ball bounces, toy truck rumbles and honks.... lots to keep a toddler occupied! Oh! The monkeys jump on and fall off the bed! Mama calls the doctor, etc! It's great.', overall=5.0, summary='This is my granddaughters favorite app on my Kindle!', unixReviewTime=1391212800, reviewTime='02 1, 2014'}
{reviewerID='A3UPYGJKZ0XTU4', asin='0615391206', reviewerName='mirasreviews', helpful=[26, 27], reviewText='There is no shortage of pop recipes available for free on the web, but I purchased the "Zoku Quick Pops" book, because Zoku has some good recipes for fruit pops on its blog. I was hoping there were more where those came from. This book emphasizes very sweet dessert pops, however. There are 41 recipes in total, only 13 of which are fruit pops. There is a "Fresh and Fruity" chapter, followed by three chapters of dessert pops entitled "I Scream for Quick Pops!", "Bake Shop", and  "Coco Loco". As you might guess from the last one, there are 15 pop recipes that contain chocolate.Chapters on "Tips" and "Techniques" are useful. There is more detailed information about ingredients that don't freeze well in the Zoku than is found in the instruction manual. The book lists options for dairy products and sweeteners, tells you how to do different types of layers, how to add decorative fruit slices, how to do a quick shell, and how to make core pops. The pages about core pops are especially helpful, as they include recipes for pink, purple, and orange outer layers for brightly-colored core pops. The book recommends using Zoku accessory kits, but you can do without.The pop recipes tend to go out of their way to be as sweet as possible. Many, including the recipe for a vanilla base, call for vanilla pudding, where vanilla Greek yogurt would do just as well. I've substituted it with no ill effect. On the bright side, many of these recipes may appeal to children, whereas most pop books that I have seen are geared more to adults. There are flavors like "Cookie Dough", "That's a S'more", chocolate peanut butter, and peanut butter and jelly. All 9 recipes in "Bake Shop" are inspired by cake and cookie recipes.As a resource for light, fresh-tasting fruit pop recipes, "Zoku Quick Pops" is very limited. Most of the fruit recipes are gimmicky and contain too many ingredients. The recipe for Lemonade pops contains orange juice, which is fine, but the addition of vanilla extract kills the fresh fruit flavor. The recipe for mango pops includes orange, apple, banana and lemon, which are too many competing flavors. Mango and orange together make a terrific pop. The book is great for chocolate lovers and those looking for dessert pop recipes. Tips and techniques are also useful. For fruit pop recipes, "Top Pops" by Emily Zaiden is far better.', overall=4.0, summary='Excels at Sweet Dessert Pops, but Falls Short on the Fruit Pops.', unixReviewTime=1367712000, reviewTime='05 5, 2013'}
{reviewerID='A2YEHF8T823TDC', asin='B004A9SDD8', reviewerName='Gale White Miller', helpful=[3, 4], reviewText='I watch my great grandson 4 days a week and it's hard to keep a 16 month old occupied but all I have to do is turn on Five Little Monkeys and he goes crazy trying to get the monkey's off the bed and touching all the other interactive things on the screen. I love this! I absolutely recommend this!', overall=5.0, summary='Terrific!', unixReviewTime=1381708800, reviewTime='10 14, 2013'}
{reviewerID='AHAI85T5C2DH3', asin='0615391206', reviewerName='PugLover', helpful=[0, 0], reviewText='This cookbook is great.  I have really enjoyed reviewing all of the recipes.  Sure - some are more difficult than others, but there is a nice variety in this book.  For me it was totally worth it just to get the quick shell recipes alone.  We have only tried the chocolate so far, but it is so tasty.  A few of my favorite recipes in this book are the banana from the strawberry banana one, and the raspberry/blackberry ones (but I used mixed berries).  Also, it has great instructions for tips on using the Zoku.  Definitely recommended.', overall=4.0, summary='A must own if you own the Zoku maker...', unixReviewTime=1402099200, reviewTime='06 7, 2014'}
{reviewerID='A3699WHISXX94Z', asin='B004A9SDD8', reviewerName='Janie Leonard', helpful=[0, 0], reviewText='This app is wild and crazy.  Little ones love singing the song about Five Little Monkeys, in this app it is available in country, rock or pop.  It is full of action with the player controlling most of it but it has a lesson included.', overall=5.0, summary='Five Little Monkeys', unixReviewTime=1389484800, reviewTime='01 12, 2014'}
{reviewerID='AXA9EVY6IJIZ5', asin='0615391206', reviewerName='Robin Cline "Solarobby"', helpful=[0, 0], reviewText='If you have a Zoku Quick Pop maker (or two....I have the original one-slot and then I bought the double-slot here at Amazon), I recommend you get this creative little book, which will inspire you.', overall=5.0, summary='Love it', unixReviewTime=1402099200, reviewTime='06 7, 2014'}
{reviewerID='A2BXV49EIES2TB', asin='B004A9SDD8', reviewerName='Kayla', helpful=[3, 4], reviewText='love love love this app. I was going through different apps for my son and I came across this one and I was excited and singing along to the song, only problem is that the song is very quite', overall=5.0, summary='love but to quite', unixReviewTime=1386720000, reviewTime='12 11, 2013'}
{reviewerID='A37HM5TMCMHJES', asin='B004A9SDD8', reviewerName='kmc', helpful=[0, 0], reviewText='Very cute, with alot of items to move about.  Would be awesome if the &#34;dr. said&#34;  was in a different voice and moved too.', overall=5.0, summary='Cute', unixReviewTime=1366934400, reviewTime='04 26, 2013'}
{reviewerID='A1FYZPJLU78R2Y', asin='B004A9SDD8', reviewerName='Linda Gibbons', helpful=[1, 2], reviewText='WELL THE CHILDREN LOVE IT AFTER AWHILE YOU GET TIERD OF IT BUT AS LONG AS THE GRANDCHILDREN LIKE IT YOU LISTEN TO IT', overall=4.0, summary='MONKEYS', unixReviewTime=1374105600, reviewTime='07 18, 2013'}
{reviewerID='A3842PXNQ1QRM9', asin='0615391206', reviewerName='Stephen Brem', helpful=[0, 0], reviewText='High quality book. Clear and helpful information, and then some superb recipe suggestions clearly outlined. I can highly recommend this product.', overall=5.0, summary='Satisfaction opinion', unixReviewTime=1401580800, reviewTime='06 1, 2014'}
{reviewerID='AV58L39SOERMI', asin='B004A9SDD8', reviewerName='LP', helpful=[1, 2], reviewText='I got this app because my 2 year old daughter loves the song. I found that the audio could have been clearer. They also could have had better or more tune options, they only offered 'rock', country', and 'pop', which I thought were horrible for this children's song. I do like that it's interactive. Everything you touch in the room does something different. Phone rings, dog chases the cat, door opens, clock goes off, etc.....neat. My daughter also enjoys all the other interactive features it has other than the monkeys falling off the bed. &#34;Wheels on the bus&#34; app by &#34;duck duck moose&#34; ranks higher because you have much more options like changing the language, gender voice options, instrumental, and self record which my daughter finds hilarious when she hears her own voice.  Overall it's ok and she likes to see the monkeys fall off the bed.', overall=3.0, summary='Could be better....', unixReviewTime=1373241600, reviewTime='07 8, 2013'}
{reviewerID='A31XG60B64OW74', asin='B004A9SDD8', reviewerName='Melissa Boysen', helpful=[3, 4], reviewText='My three year old Plays this game the most he loves being able to touch all the different things and watch what happens. Keeps him busy for hours', overall=5.0, summary='Five little monkeys', unixReviewTime=1368576000, reviewTime='05 15, 2013'}
{reviewerID='A39JZ61LPIVY91', asin='B004A9SDD8', reviewerName='Mimi', helpful=[1, 2], reviewText='Good for little ones, especially if  know the nursery rhyme.  Once you show them what to click on they pick it up fast.', overall=3.0, summary='Good for small children', unixReviewTime=1367539200, reviewTime='05 3, 2013'}
{reviewerID='AIRKROQMCBVG4', asin='B004A9SDD8', reviewerName='NINA WHEELER', helpful=[3, 3], reviewText='My two year old grandson loves this game and plays it constantly !!  Keeps him busy for quite some time.', overall=5.0, summary='Fun, fun, fun !!', unixReviewTime=1385942400, reviewTime='12 2, 2013'}
{reviewerID='A14BTJRH9VNLJJ', asin='0689027818', reviewerName='Kurt A. Johnson', helpful=[1, 2], reviewText='This is the story of a group of butterflies looking for a place to sleep. Each one is a different color, and each pair of facing pages (color-coordinated, of course!) tells the story of where each of the butterflies found to sleep. Each of the butterflies is shown as a brightly-colored, foil-looking toy that your little one will not be able to resist touching.My little one absolutely loved this book, and it did go great as a preparing for sleep read. The colors and the butterflies, and the cute story all were a hit. We both highly recommend this book!', overall=5.0, summary='My little one absolutely loved this book', unixReviewTime=1365206400, reviewTime='04 6, 2013'}
{reviewerID='A39TLD5D8M76M4', asin='B004AFQAUA', reviewerName='null', helpful=[0, 0], reviewText='does not let you sample only for a sec. if you download  it to computer it talk your music you have try to sell it back to too. if you join with a membership and if you don't pay they  sell your music on your computer . how when you combine your to there player . i know cause the did it to me had rhapsody a long time unit  it happen i close the account . don't mine paying. but not for music i have  before that . had the old look . at the time now it worse', overall=1.0, summary='dont play there', unixReviewTime=1405296000, reviewTime='07 14, 2014'}
{reviewerID='A2XJJKZSEYYW8T', asin='B004AFQAUA', reviewerName='A Customer', helpful=[0, 0], reviewText='this is a very good app and it you need this service then this is the app for you to enjoy.', overall=5.0, summary='app', unixReviewTime=1394064000, reviewTime='03 6, 2014'}
{reviewerID='A13BMNAQ2K5LLN', asin='0912696591', reviewerName='AcuDoc "What would life be like without books...', helpful=[0, 0], reviewText='For a novice cake decorator who got talked into making her son's wedding cake, Wilton makes lovely cake decorating accessories to help with every step.  This book gave me so many great ideas and wonderful recipes as well!  This cake had a 16&#34; square base, 10&#34; sq middle layer and 6&#34; top layer all set 90 degrees.  For a first wedding cake, it was amazing with Wilton's help!  This book is a must have for newbies like me.', overall=5.0, summary='Wilton Rocks!', unixReviewTime=1399161600, reviewTime='05 4, 2014'}
{reviewerID='AJ9JRKE8AADW0', asin='B004AFQAUA', reviewerName='Allison Janezic', helpful=[1, 1], reviewText='It's easy to use and transfer songs. If I purchase songs I usually use iTunes but Rhapsody allows me to get songs and listen to them before I purchase them. However, some albums are only allowed to be purchased which I find annoying. I think they need to allow subscribers to get them for the fee. After all we can not keep them if we are not subscribers.', overall=4.0, summary='Worth the monthly fee', unixReviewTime=1363478400, reviewTime='03 17, 2013'}
{reviewerID='A3LHQ0LXICBLY2', asin='0912696591', reviewerName='AE', helpful=[1, 1], reviewText='I should not have bought it because it comes free from my cake decorating class. Oh well, at least I gave the other copy to my sister.', overall=5.0, summary='I should not have bought it.', unixReviewTime=1370563200, reviewTime='06 7, 2013'}
{reviewerID='A17YPB3JICRUK2', asin='B004AFQAUA', reviewerName='Amazon Customer "StormyJ"', helpful=[0, 1], reviewText='If you pay for the subscription then by all meens get this App. It works well and  I love the service. I have a family of 4 and we all use it under one price.', overall=5.0, summary='Rhapsody', unixReviewTime=1383264000, reviewTime='11 1, 2013'}
{reviewerID='A2S3ZE0RI9I60A', asin='0912696591', reviewerName='alma morsell', helpful=[0, 0], reviewText='helpful information on decoraing basics. Good book for beginners who need step by step instructions and guidance. Good for all age groups.', overall=4.0, summary='This is a good book for anyone interested in cake decorating.', unixReviewTime=1386892800, reviewTime='12 13, 2013'}
{reviewerID='A33T8O72UNBVR', asin='0912696591', reviewerName='Amar Rhom', helpful=[1, 1], reviewText='Got this for my girlfriend who runs a baking business and she said it was handy to have for a reference book. She said it is handy to have when thinking of decorating ideas.', overall=5.0, summary='Handy to Have', unixReviewTime=1370649600, reviewTime='06 8, 2013'}
{reviewerID='A28HK5XEA7B1K1', asin='B004AFQAUA', reviewerName='Anna Bernyc "Snow White (Book Angels12)"', helpful=[2, 2], reviewText='We love Rhapsody we use it all the time. Affordable and we can have it on 3 devices at once. We are so done wasting money on our itunes acct.5 stars all the way', overall=5.0, summary='Amazing', unixReviewTime=1374969600, reviewTime='07 28, 2013'}
{reviewerID='A1B9BZ3AJ5V1NJ', asin='0912696591', reviewerName='Amazon Customer', helpful=[0, 0], reviewText='I'm hoping that I can learn how to make gum paste flowers to perfection for my daughters wedding, and maybe a few other cakes.', overall=5.0, summary='learning', unixReviewTime=1400630400, reviewTime='05 21, 2014'}
{reviewerID='AAGR17G2JXJLT', asin='B004AFQAUA', reviewerName='Annette L. Goldis', helpful=[2, 5], reviewText='It just doesn't do what I needed it to do.  For someone else maybe, but I get lost in my own house LOL.', overall=1.0, summary='Didn't do', unixReviewTime=1372204800, reviewTime='06 26, 2013'}
{reviewerID='AG6A7QDC8L9R', asin='B004AFQAUA', reviewerName='Brian F', helpful=[0, 0], reviewText='I Have to Say that of All of the Many Other Music Player Apps.Around,(This 1 has the Best Overall Selection of All)!!!If you like Obscure Stuff Especially!!!!', overall=5.0, summary='Maybe Best Overall Selection!!!', unixReviewTime=1389571200, reviewTime='01 13, 2014'}
{reviewerID='A1UTFW6LO2I0DR', asin='B004AFQAUA', reviewerName='Casey', helpful=[1, 1], reviewText='I have used most every subscription music service and when it comes to their apps, Rhapsody's offers one of the best experiences. While Spotify revolves heavily around playlists and radio, Rhapsody has both and a whole lot more. It is much easier to navigate and find the music you are looking for and it includes easy access to your saved music library. Plus you can download individual tracks, albums, and playlists for offline play. Both the interface and visual appearance are very nice. The sound quality tops out at 192 kbps AAC+, which is not as high as some services, but sounds great from my experience. There is a lower setting if you need to save data usage. Any song in their library can be listened to on-demand (or as part of a playlist or radio station) through their app. All ad-free.The service itself requires a subscription, currently $10 per month. While they do have free trials, they do not currently have a free version of the service. So if you are not interested in subscribing or giving it a trial run, then this app is probably not for you.I use this app on my first generation Kindle Fire and so far no complaints.', overall=5.0, summary='Great Music App', unixReviewTime=1387411200, reviewTime='12 19, 2013'}
{reviewerID='A2I5YZBMLU2R7O', asin='0912696591', reviewerName='Aniusia', helpful=[0, 1], reviewText='I am very happy I purchased this book as it containes so much great information and time saving tips. I highly recommend.', overall=4.0, summary='good tips', unixReviewTime=1367884800, reviewTime='05 7, 2013'}
{reviewerID='AK3IFCDU88TI9', asin='B004AFQAUA', reviewerName='C. Riostirado', helpful=[2, 2], reviewText='I love my rhapsody!! I was so glad that I could get it on my kindle for my daughter!! I have had Rhapsody since it was Napster...love that it is a device that we can use it on!', overall=4.0, summary='Love it!', unixReviewTime=1385164800, reviewTime='11 23, 2013'}
{reviewerID='A1LAAZUR8YFRW8', asin='0912696591', reviewerName='Barbara "barbara11td"', helpful=[0, 0], reviewText='I have always wanted to learn how to decorate a beautiful cake, and I purchased this guidebook along with The Wilton Pastry bag kit.  I appreciate how this guide gives tips on how to bake the perfect cake, and also gives detailed step-by-step instructions on how to use the pastry bag to make many different designs. I do, however, agree that this book did appear to be an advertisment for thier products, but the guide was helpful nonetheless.', overall=4.0, summary='Great For Beginners!', unixReviewTime=1376611200, reviewTime='08 16, 2013'}
{reviewerID='A6A6AR0XGSTXB', asin='0912696591', reviewerName='B. Petree "B&#62;N&#62;P&#62;"', helpful=[0, 0], reviewText='This lesson plan is perfect for a beginner and definitely helped introduce working with fondant in a user-friendly way.  Thanks, Wilton.', overall=4.0, summary='Great', unixReviewTime=1377043200, reviewTime='08 21, 2013'}
{reviewerID='A2HC94KQKVGIA1', asin='B004AFQAUA', reviewerName='D. Stephens', helpful=[2, 3], reviewText='Rhapsody is great if you like "All you can Eat" music..  There are a lot of music programs and services out there now but I always come back to Rhapsody for a couple reasons.1.) I love their desktop app!!2.) I love being able to use the service with a REAL mp3 player, not just an android phone or ipod touch/iphone.  With the desktop app, the service works with Sandisk MP3 Players (Most are supported but check rhapsody before you purchase one)Now for this app.  The app on android and Kindle is great.  It gives you access, not just to their radio feature, but also to their "all you can eat" music service.  You can download the tracks to your phone for free (As long as you keep paying the monthly fee, these songs stay active".  Their "radio" feature is great if you like services like Pandora.  The Rhapsody radio doesn't have the ads like Pandora and other free radio services.  The radio feature is also very smart just like Pandora (Though I would say it is not as smart as Pandora).Overall this is a great app if you like music and like being able to choose what songs you want to listen to or if you wanna listen to an entire album!!  And the app doesn't bog the phone down with adds or video adds like Pandora!Try it for a month!! Most new phones and kindles will give you a free trial! If not you can use this link for one.. I was one over with the free trial I received when I downloaded this app to my Kindle[...]', overall=5.0, summary='Great App for, Kindle or Phone', unixReviewTime=1375401600, reviewTime='08 2, 2013'}
{reviewerID='A18G4LXVA8E57D', asin='B004AFQAUA', reviewerName='Emelia Engleman', helpful=[4, 4], reviewText='Awesome choice of music, but I can't have my kindle and my phone signed up together, even though you can have up to 3 computers, which sucks. And I can't find the music I've downloaded anywhere in my device.', overall=4.0, summary='can't find my downloads but had every album ever!', unixReviewTime=1373846400, reviewTime='07 15, 2013'}
{reviewerID='AFU78TXR52SOD', asin='0912696591', reviewerName='Cathy', helpful=[0, 0], reviewText='This dvd is a must for any cake decorator.  It is presented in short and easy to understand segments.  It works great for the beginner or as a quick refresher.  The instructor did an outstanding job of both explaining and demostrating?', overall=5.0, summary='great instruction', unixReviewTime=1400198400, reviewTime='05 16, 2014'}
{reviewerID='AZN94X9HSS594', asin='B004AFQAUA', reviewerName='Filmguy', helpful=[0, 0], reviewText='It allows me to access Rhapsody on my Kindle which I would not be able to do without the app.', overall=5.0, summary='It works', unixReviewTime=1388707200, reviewTime='01 3, 2014'}
{reviewerID='A3DW3YFVVAWDSW', asin='B004AFQAUA', reviewerName='Frequent Amazon Shopper', helpful=[2, 3], reviewText='I have been a subscriber to Rhapsody for more than 5 years.  The selection of music in the genres that I like to choose from is adequate...nothing great!!!  I only stay with them because I need to update the license every 30 days or so in order to listen to the music I have downloaded to my MP3 player.  But I am giving serious consideration to going to an alternative music source.  Reason you asked...the software is very &#34;unstable&#34; in my opinion.  It frequently locks up at the most inopportune times.  Obviously, this requires restarting the software program and reloading what I had already begun.  It happens so often, that it has become a pain in the backside.At this point, I would not be strongly recommending Rhapsody to others.', overall=3.0, summary='Long Time Subscriber', unixReviewTime=1377820800, reviewTime='08 30, 2013'}
{reviewerID='AZ47G9E2U2T9L', asin='0912696591', reviewerName='Christine Marquis', helpful=[0, 0], reviewText='This has certainly improved my cake decorating knowledge as a pure novice. I will now purchase the other books so I can learn more.', overall=5.0, summary='Definitely love it', unixReviewTime=1364515200, reviewTime='03 29, 2013'}
{reviewerID='A1CSAU5Q1UZI85', asin='B004AFQAUA', reviewerName='gemigirl68', helpful=[1, 1], reviewText='I love rhapsody. I always used it to listen to music or find new songs to download on my devices.', overall=5.0, summary='I love it', unixReviewTime=1363737600, reviewTime='03 20, 2013'}
{reviewerID='A301O3AYBDXMTQ', asin='0912696591', reviewerName='C. SIMMONS', helpful=[1, 1], reviewText='This is so remedial.  Buy a Wilton magazine for less money and get more ideas and instructions for your investment.', overall=1.0, summary='Waste of money', unixReviewTime=1397347200, reviewTime='04 13, 2014'}
{reviewerID='A3WH0FZKD9K94', asin='0912696591', reviewerName='Customer', helpful=[0, 0], reviewText='A good tool for home use.  Shows several types of simple, easy to perform techniques.  Would recommend for beginners and home bakers.', overall=4.0, summary='Good for beginners', unixReviewTime=1368057600, reviewTime='05 9, 2013'}
{reviewerID='A3H8IE60X1L8ZY', asin='0912696591', reviewerName='C. Vang "CKV"', helpful=[0, 0], reviewText='Perfect! not bad of a book. I would recommend this item to anyone! Works great for baking! I would buy again.', overall=5.0, summary='great book', unixReviewTime=1389830400, reviewTime='01 16, 2014'}
{reviewerID='AC2WXL4UEMNW0', asin='B004AFQAUA', reviewerName='Jennifer', helpful=[0, 1], reviewText='No matter what kind of music I want to listen to, its there! I even get a guided meditations anytime I want! Its unlimited!', overall=5.0, summary='music to my mood!', unixReviewTime=1364515200, reviewTime='03 29, 2013'}
{reviewerID='AUPCERMZ6ASML', asin='B004AFQAUA', reviewerName='JK', helpful=[2, 2], reviewText='I love Rhapsody but it costs additionally a monthly fee in order to use your rhapsody account on an android tablet. Unless you are constantly on your tablet I don't think this is worth the cost.', overall=3.0, summary='Additional Cost involved with Rhapsody', unixReviewTime=1372636800, reviewTime='07 1, 2013'}
{reviewerID='A1LHJ32NVLJ5QS', asin='B004AFQAUA', reviewerName='jodystaf', helpful=[4, 5], reviewText='You have to go onto a computer to sign up. Well I don't own a computer!Make it so you can sign up in the app', overall=2.0, summary='why', unixReviewTime=1364515200, reviewTime='03 29, 2013'}
{reviewerID='A2EB1CJNA7Y194', asin='B004AFQAUA', reviewerName='kathy', helpful=[2, 5], reviewText='wanted to find a music app that was free this one was not and was way too much money for what I was looking for.', overall=1.0, summary='don't waste your money', unixReviewTime=1371427200, reviewTime='06 17, 2013'}
{reviewerID='A2KA24GDB40DWI', asin='0912696591', reviewerName='Deborah Washington', helpful=[0, 0], reviewText='This book is okay, but I was expecting a much larger book than this. This book is the size of my hand and hard to see the small writing when you're trying to prepare and read it at the same time.', overall=3.0, summary='Disappointed again!', unixReviewTime=1395014400, reviewTime='03 17, 2014'}
{reviewerID='A2CP4SK6TVPEV3', asin='0912696591', reviewerName='Debra G.', helpful=[1, 1], reviewText='Wonderful to have a reference book handy with step-by-step instructions -- I used when I was covering my first cake in fondant and it was so easy!', overall=5.0, summary='Great Reference', unixReviewTime=1395273600, reviewTime='03 20, 2014'}
{reviewerID='A35U1NNA7TL9HM', asin='B004AFQAUA', reviewerName='Margaret Ventresca', helpful=[0, 0], reviewText='Greatest hits and win the strength slots with Elvis Presley slots are greatest so much a hit with slotomania. So keep it the higher rating.', overall=5.0, summary='cool', unixReviewTime=1395532800, reviewTime='03 23, 2014'}
{reviewerID='A1RFEO61AGIRPR', asin='0912696591', reviewerName='DeeAnn G. Kline', helpful=[0, 0], reviewText='My youngest daughter requested this as a gift.  She was very happy with it and I may buy another one for my middle daughter.', overall=5.0, summary='Gift', unixReviewTime=1391558400, reviewTime='02 5, 2014'}
{reviewerID='A42A5GQ9G0POX', asin='B004AFQAUA', reviewerName='mark stumpo', helpful=[0, 0], reviewText='Have been using it for years, millions of choices to choose from.  Easy program interface to use.  Audio quality is great.', overall=5.0, summary='Great music program', unixReviewTime=1381622400, reviewTime='10 13, 2013'}
{reviewerID='A2ULTURZ2X0CIN', asin='B004AFQAUA', reviewerName='Martha L. Rios Hernandez', helpful=[1, 2], reviewText='is the music I like, non-commercial, so I recommend it, every day my daughters and I heard music, they doing their homework and I cleaning my house and the songs are our inspiraton, thank you', overall=5.0, summary='excellent music &lt;3', unixReviewTime=1379116800, reviewTime='09 14, 2013'}
{reviewerID='A1HW31KJ9V89CR', asin='B004AFQAUA', reviewerName='Mary Ann Winstead', helpful=[0, 0], reviewText='Love that I can type any song in and it comes up quick. Better than Pandora.', overall=5.0, summary='rhapsody', unixReviewTime=1404259200, reviewTime='07 2, 2014'}
{reviewerID='A2TOL9QN6PKOWE', asin='B004AFQAUA', reviewerName='Marylin Hall "My Melody"', helpful=[1, 1], reviewText='I had Napster before it changed to Rhapsody. I love Napster. being to listen to any music genre I'm in the mood for no matter where I am.I would recommend this product to anyone who likes music. The monthly plans are also very reasonable.', overall=5.0, summary='Love this', unixReviewTime=1371427200, reviewTime='06 17, 2013'}
{reviewerID='A39Z5FLKY617LZ', asin='B004AFQAUA', reviewerName='Mike Charles', helpful=[0, 0], reviewText='I happen to like the country genre, and the music sounds are unbeatable! I believe this would true with any genre that you  might like!', overall=5.0, summary='Awesome music!', unixReviewTime=1393200000, reviewTime='02 24, 2014'}
{reviewerID='A23097NC41JAX', asin='0912696591', reviewerName='Ellen T.', helpful=[0, 0], reviewText='The Book is very easy to read and follow it breaks down working with fondant and Gum Paste very Simple', overall=5.0, summary='Gun Paste and Fondant and Lesson Plan', unixReviewTime=1362528000, reviewTime='03 6, 2013'}
{reviewerID='A1SDSSRKEV13C7', asin='B004AFQAUA', reviewerName='Ms. Shon', helpful=[1, 1], reviewText='I like it cause the music can be saved and stored in rhapsody song match and if you have an account with them your music is automatically saved.', overall=5.0, summary='my preference', unixReviewTime=1368662400, reviewTime='05 16, 2013'}
{reviewerID='A7I07FM1P4WBV', asin='0912696591', reviewerName='Elvira Quijas', helpful=[0, 0], reviewText='I loved all the information I found in this book, very good ideas and pictures I recommend it to new beginners', overall=5.0, summary='great book', unixReviewTime=1363996800, reviewTime='03 23, 2013'}
{reviewerID='A21U1IHMXD0WOU', asin='B004AFQAUA', reviewerName='PEM', helpful=[1, 2], reviewText='I love Rhapsody and have it on my home computer.  But this AP wanted me to pay for a second membership for it. I deleted it from my kindle', overall=1.0, summary='Unhappy', unixReviewTime=1384300800, reviewTime='11 13, 2013'}
{reviewerID='AU10792LN4C9O', asin='B004AFQAUA', reviewerName='Pinstripe KING', helpful=[0, 0], reviewText='Excellent source for music if your  willing to pay for the service.  If you're looking for music give it a try, they give you a free trail. If you don't like it you can always look elsewhere.', overall=4.0, summary='good music', unixReviewTime=1390953600, reviewTime='01 29, 2014'}
{reviewerID='A1VA4TXD90VINO', asin='B004AFQAUA', reviewerName='Randy Ramirez', helpful=[0, 0], reviewText='This simply is the best app for music. $10 is a great price to get all of your favorite songs classic and modern. Don't go anywhere else. Falsify is the best', overall=5.0, summary='The Best App for music', unixReviewTime=1391299200, reviewTime='02 2, 2014'}
{reviewerID='A2S6E2EQ2CM7FG', asin='B004AFQAUA', reviewerName='R', helpful=[0, 0], reviewText='This app was a free trial for a certain amount of time. I used it daily when I downloaded it.  I enjoyed being able to listen to any song I was in the mood for.', overall=5.0, summary='Liked it', unixReviewTime=1394668800, reviewTime='03 13, 2014'}
{reviewerID='A2DZV9ZBWHQJ2U', asin='0912696591', reviewerName='iMinmei', helpful=[0, 0], reviewText='This is more of a packing review than a review of product.  The book does what it's intended to do. However it came all folded up the packing was real bad the book is folded vertically and horizontally!!!! I bought it because the store I go to was out of it. It came in 24 hours so I was grateful for that. Again the packing was BAD!', overall=5.0, summary='ok', unixReviewTime=1364515200, reviewTime='03 29, 2013'}
{reviewerID='AU37CZS0ND42K', asin='B004AFQAUA', reviewerName='R. Olson "Randy2u"', helpful=[0, 0], reviewText='Works great!  Sign in once and get most of your music at your fingertips!  Not all music is readily available, but most is right there!', overall=5.0, summary='Nice addition to Rhapsody Account', unixReviewTime=1398729600, reviewTime='04 29, 2014'}
{reviewerID='A1WZ74NTRDWEYN', asin='0912696591', reviewerName='Jaleen J.', helpful=[0, 0], reviewText='Was exactly as stated. Very pleased with my purchase. Will order the rest of  the set. Great product. Very useful.', overall=5.0, summary='Cake Design Book', unixReviewTime=1362528000, reviewTime='03 6, 2013'}
{reviewerID='A1HQGRBQ86S62S', asin='B004AFQAUA', reviewerName='Rosebud "Rose"', helpful=[4, 4], reviewText='Rhapsody it great to have on your tablet or computer. Great music with famous artists and songs for free and you also can upgrade to avoid ads,but for me  its ok with the ads for free.', overall=5.0, summary='Great Radio Station', unixReviewTime=1377388800, reviewTime='08 25, 2013'}
{reviewerID='A3AO0JWK3MRFI7', asin='B004AFQAUA', reviewerName='SEPepper', helpful=[0, 1], reviewText='I've been using Rhapsody since the former Yahoo Music days.  The app for Kindle works great, just like the apps for the other Android devices.', overall=5.0, summary='Longtime Rhapsody user', unixReviewTime=1369526400, reviewTime='05 26, 2013'}
{reviewerID='ARZE5N5ZTX6IA', asin='B004AFQAUA', reviewerName='Shane', helpful=[2, 4], reviewText='I just wanted a music player for what I already own.  This charges you to listen to music that is provided.  Dev needs to be more clear about this.', overall=1.0, summary='Have to Subscribe', unixReviewTime=1370822400, reviewTime='06 10, 2013'}
{reviewerID='A2CQIPWOMEIC1F', asin='0912696591', reviewerName='Johanna', helpful=[0, 0], reviewText='I bought this and the 2012 a the same time, only to realise half the book has the same info. It's more a catalog than a book of ideas. It does have some picture but it is basically the same as the 2012 year. It has a couple of recipes, but the are the same on both the yearbooks.I bought it because I wanted to learn how to make things with a step-by-step guide. It is not that.', overall=3.0, summary='First time buying a Wilton yearbook. Won't do it again', unixReviewTime=1377993600, reviewTime='09 1, 2013'}
{reviewerID='A18GP785BTTW43', asin='B004AFQAUA', reviewerName='Snowfro', helpful=[0, 0], reviewText='We can't get enough of Rhapsody! I play it everyday for the entire house as we work and play. It is amazing!', overall=5.0, summary='&lt;3 Rhapsody', unixReviewTime=1387238400, reviewTime='12 17, 2013'}
{reviewerID='A2SGP12DUE97BQ', asin='0912696591', reviewerName='KARichards', helpful=[0, 0], reviewText='I purchased the Wilton Course 1 guide a few weeks before I took my class, I found the book very easy to follow and easy to understand.  The only regret i had was my copy was different than the one handed out in class; the page numbers were different and it slowed me down a bit.', overall=5.0, summary='Easy to follow', unixReviewTime=1382054400, reviewTime='10 18, 2013'}
{reviewerID='AH92YM3MGDO0V', asin='0912696591', reviewerName='Kathelyn Michel', helpful=[0, 1], reviewText='Maybe this one was an earlier print, but my classmates and instructor's course booklets were a few pages different.No biggie though. Same material.', overall=5.0, summary='works great just different from the one at michaels', unixReviewTime=1395446400, reviewTime='03 22, 2014'}
{reviewerID='A9M5E4QA1HR3P', asin='B004AFQAUA', reviewerName='SuzannefromSC', helpful=[0, 0], reviewText='can download all the songs i like and it is easy as pie!! my son got me interested and am so glad he did. Will continue to use this app!!', overall=5.0, summary='love it!!', unixReviewTime=1366588800, reviewTime='04 22, 2013'}
{reviewerID='A1S1MURSGWKW2Q', asin='0912696591', reviewerName='Leanna Dexter', helpful=[2, 2], reviewText='I have never been a good cake decorator. It has always been just out of reach. This book made me say &#34;duh&#34; in my head so many times it's embarrassing. It really breaks it down and simplifies some of the basic techniques for noobies (like myself).', overall=4.0, summary='Duh', unixReviewTime=1373673600, reviewTime='07 13, 2013'}
{reviewerID='A2EDUKOZI4LTZE', asin='B004AFQAUA', reviewerName='vanessa', helpful=[2, 2], reviewText='I love Rhapsody especially the updated version. My whole family uses it. We have it on all our gadgets. recommended', overall=5.0, summary='love', unixReviewTime=1373932800, reviewTime='07 16, 2013'}
{reviewerID='A3RBNX9XVSAUE5', asin='B004AFQAUA', reviewerName='W. Bradley', helpful=[0, 1], reviewText='This application simply did not work the way I thought it ought to work. When I loaded the app on my device I thought I would be able to load selected tunes from my PC library to this. Instead the app displayed a mind of its own and loaded songs at random. Not at all user friendly.', overall=1.0, summary='Didn't Work For Me', unixReviewTime=1385942400, reviewTime='12 2, 2013'}
{reviewerID='AQB8VCM8FNPCJ', asin='0912696591', reviewerName='lissasaves', helpful=[0, 0], reviewText='Easy to follow even for a clutz like me! Very informative and the instructions are straight forward. Im new to cake decorating so I have really enjoyed this book.', overall=5.0, summary='Lovbe this book!', unixReviewTime=1392422400, reviewTime='02 15, 2014'}
{reviewerID='A35JLHWBIR2PVE', asin='B004AHBBPW', reviewerName='Abby Craig', helpful=[0, 0], reviewText='The best part of this app is that you can listen to free podcasts or sermons. I love hearing Joel Osteen so this is my fav feature.', overall=5.0, summary='I like being able to listen to sermons on here', unixReviewTime=1389398400, reviewTime='01 11, 2014'}
{reviewerID='A35XFI5R1FHQHL', asin='0912696591', reviewerName='L. Tomk "Shopping Fool"', helpful=[0, 0], reviewText='I bought this for my daughter.  She likes to do cupcakes for parties.  She said it has good instructions and pictures and was helpful.', overall=5.0, summary='Great book for beginners', unixReviewTime=1381104000, reviewTime='10 7, 2013'}
{reviewerID='A2R2MAYHN4F7GU', asin='B004AHBBPW', reviewerName='Alexis', helpful=[0, 0], reviewText='Every morning I wake up to an inspirational bible verse. It helps me clear my mind before a long day. I can save the verses also if I want to refer back to them in troubling times. It even works without an internet connection somehow. I was on a cruise with no internet or mobile data and i STILL received my verses. Such a blessing!', overall=5.0, summary='Start the day right', unixReviewTime=1377475200, reviewTime='08 26, 2013'}
{reviewerID='A2UDHBWX0GPCPN', asin='B004AHBBPW', reviewerName='Alison Gill', helpful=[0, 0], reviewText='It is so nice to have the Bible at your disposal. I love the reading plans and well as the fact that it can be read to you.', overall=5.0, summary='Bible reader', unixReviewTime=1386633600, reviewTime='12 10, 2013'}
{reviewerID='AW5YKR2WH2KVX', asin='B004AHBBPW', reviewerName='amanda hinshaw', helpful=[0, 0], reviewText='Remove', overall=5.0, summary='Five Stars', unixReviewTime=1404086400, reviewTime='06 30, 2014'}
{reviewerID='A1JQUCTFM4UKMQ', asin='0912696591', reviewerName='M. Antillon', helpful=[0, 0], reviewText='I learned a few tricks from this book. I am new to baking nice looking stuff. This helped me become a better decorator and got courses 2,3 and 4 as well. I wouldn't have picked anything else. Wilton hasn't disappointed me yet.', overall=5.0, summary='Helpful', unixReviewTime=1377648000, reviewTime='08 28, 2013'}
{reviewerID='AZRTCDO8S6V4U', asin='B004AHBBPW', reviewerName='Amazon Customer', helpful=[1, 1], reviewText='Clean, simple, easy to use. Daily verse, choice of Bible version, devotionals and pod casts. Would recommend to anyone! A real blessing!', overall=5.0, summary='very nice!', unixReviewTime=1402185600, reviewTime='06 8, 2014'}
{reviewerID='AWZELHKAKP3NL', asin='0912696591', reviewerName='Marie Arlene Smith', helpful=[0, 0], reviewText='Took class years ago, using this as a refresher before starting a cake. Sometimes a video is faster than a book. Happy with Wilton items. Came fast .Stores don't carry video.', overall=5.0, summary='Renew knowledge', unixReviewTime=1405036800, reviewTime='07 11, 2014'}
{reviewerID='A3HNHXHQ5BGAOX', asin='0912696591', reviewerName='Mary Ann McGraw', helpful=[0, 0], reviewText='Itr was fine  I was hoping for more  but it was as promisedI was purchased as a gift and they enjoy it', overall=3.0, summary='I hoped for more', unixReviewTime=1364256000, reviewTime='03 26, 2013'}
{reviewerID='A1WZEWW0JR7HKR', asin='0912696591', reviewerName='maryann rojas', helpful=[0, 0], reviewText='This  book is good for some one that has taken the Wilton class it has some useful  Tips  not really what I wanted yet it's not bad it can be useful', overall=5.0, summary='Re wilton', unixReviewTime=1386115200, reviewTime='12 4, 2013'}
{reviewerID='A2834IANCITL7X', asin='B004AHBBPW', reviewerName='Beverly B. Sloan', helpful=[1, 1], reviewText='I enjoy my Daily Bible as I enjoy reading a verse when I firstopen my cell phone in the morning.  I find it very inspirational.', overall=5.0, summary='Bible', unixReviewTime=1395360000, reviewTime='03 21, 2014'}
{reviewerID='A1WVYWE8IG9EIX', asin='B004AHBBPW', reviewerName='Bondo', helpful=[0, 0], reviewText='Thank you for the DAILY BIBLE, JoanSoft.....  I now start my day with listening to the DailyVerse.  I am a religious person but not to the extreme.  Listening to the DailyVerse reminds me of my days in grade school when we started the day off by reading from the Bible. It didn't hurt anyone and I know it helped me.  Thanks again for a great app.', overall=5.0, summary='Old Time Memories', unixReviewTime=1366243200, reviewTime='04 18, 2013'}
{reviewerID='AXQA8YU9YIMV4', asin='0912696591', reviewerName='M. Lawrence "MAD"', helpful=[0, 0], reviewText='I am trying my best to get into FONDANT and THIS book has motivated me to try harder and harder.  It has already paid for itself and has brought me back into the world of making family cakes as opposed to spending a TON at the Bakery!  THANK YOU for a wonderful book!', overall=5.0, summary='AWESOME IDEAS', unixReviewTime=1397692800, reviewTime='04 17, 2014'}
{reviewerID='A2BWUQQT2X4WJM', asin='0912696591', reviewerName='M. Tennant', helpful=[0, 0], reviewText='This short-but-sweet (ha) book gives all the basic information you need to get started with cake decorating.  It shows how to make a number of shapes with the icing, an icing recipe, and has lots of helpful illustrations.  Between this book and how-to videos found online, you could probably get enough information to be able to make pretty cakes without having to attend lessons.', overall=5.0, summary='Very Good Book For Beginners', unixReviewTime=1363132800, reviewTime='03 13, 2013'}
{reviewerID='A2UL1FLFZX1HZ7', asin='B004AHBBPW', reviewerName='cherry', helpful=[2, 2], reviewText='unless you are connected you will not be able to read the Bible. I did like the daily verse of the day. There are also many different versions of the bible that you can choose to read from when you are connected to the internet.', overall=3.0, summary='YOU NEED INTERNET CONNECTION !!!', unixReviewTime=1364083200, reviewTime='03 24, 2013'}
{reviewerID='A15M72A7ILQ2EV', asin='B004AHBBPW', reviewerName='Chooliki', helpful=[0, 0], reviewText='I am able to share and send devotions to my friends of many different speakers. Also you can find many different types of devotions with different versions of the Bible. Love it.', overall=5.0, summary='Great. Packed with many different devotions.', unixReviewTime=1382745600, reviewTime='10 26, 2013'}
{reviewerID='A3173BUN91R8RF', asin='B004AHBBPW', reviewerName='Chris St Pierre', helpful=[2, 2], reviewText='What a refreshingly wonderful app. There is so much content out there that to have it all mailed to me would be overwhelming. Thanks to these wonderful people I have been able to expand my spiritual walk to measures unknown to me. My eyes have been opened to revelations and deep understanding that otherwise I had been ignorant to. By having and using this app my daily morning study gets me ready for the day and keeps my heart in tune with God.It is customizable to which content I decide to read and listen to. Because of the audio portion my spiritual walk has encountered a new path of what can only be described as an old friend. That is how he will make you feel after just a short listen. I am talking about Pastor McGee and his TTB Bible radio program. It is a five year journey through the entire Bible and no one has been able to explain it as he has.McGee has a unique view into the word of God and looking back he was indeed at the beginning movement of the Christian non denominational faith. He saw the way had been opened and how chains of hierarchy and rules of the old establishment were being abandoned.He is only one of many podcasts that are available, from daily to old sermons to modern convention speeches. Rick Warren has a spot there as well as Joyce Meyers and so many others.Daily reading plans and so many wonderful features.I have gained so much for so long that some time back I became a regular supporter  of their ministry for it is with these works that many are being baptized in the Holy Spirit.', overall=5.0, summary='Outstanding', unixReviewTime=1364083200, reviewTime='03 24, 2013'}
{reviewerID='A2GRRIDO41P23T', asin='0912696591', reviewerName='Sarahsong0302', helpful=[0, 0], reviewText='This is a small simple book but tons of basic information on baking. I really loved the graphs regarding the piping tips - I have so many of them but never knew what exactly do they do. So that was really nice to figure out everything on the chart with the pipe tip number!', overall=5.0, summary='simple book but tons of info', unixReviewTime=1398297600, reviewTime='04 24, 2014'}
{reviewerID='A1QKU0PA9VYSFL', asin='B004AHBBPW', reviewerName='Christine Pierce', helpful=[1, 1], reviewText='This isn't a bad ap, but I prefer Our Daily Bread and Daily Bible Devotion better.  I do read it once in a while.', overall=3.0, summary='Devotion', unixReviewTime=1363651200, reviewTime='03 19, 2013'}
{reviewerID='A33H5DIDZFGYYS', asin='B004AHBBPW', reviewerName='C. Stanley', helpful=[0, 0], reviewText='ONLY i wish it was in other versions, like the ESV, and the NKJV ~ but this is a great study/read!', overall=5.0, summary='Love', unixReviewTime=1392249600, reviewTime='02 13, 2014'}
{reviewerID='A1NK5N4PPFBMO4', asin='B004AHBBPW', reviewerName='Danielle', helpful=[0, 0], reviewText='It gives you an update everyday on any verse it's kinda like the verse of the day.If you want it to read to you it will.If you get distracted a lot just  put in your ear-buds and listen to it.', overall=4.0, summary='Great', unixReviewTime=1370822400, reviewTime='06 10, 2013'}
{reviewerID='A11WUS9O24PNXB', asin='0912696591', reviewerName='Silly Mee', helpful=[0, 0], reviewText='I really like the Wilton Method courses. I do have some background in cake design, but this really helped me take it all to the next level. I still need lots of practice with flowers so this is perfect for me. I would have liked a few more tips and a bit more direction, but on the whole it was worth the money.', overall=4.0, summary='Very Informative', unixReviewTime=1383782400, reviewTime='11 7, 2013'}
{reviewerID='A1R6YNQW8W1YQ1', asin='B004AHBBPW', reviewerName='David Elenbaas', helpful=[0, 0], reviewText='It is good but I was looking for more.I could be what you need so give it a try.', overall=3.0, summary='good', unixReviewTime=1391904000, reviewTime='02 9, 2014'}
{reviewerID='A3H4O02M0VJVML', asin='B004AHBBPW', reviewerName='Delia', helpful=[0, 0], reviewText='I mostly listen to the scripture for the day.  Sometimes experience difficuly with podcasts.  Good source of reference. Pop ups to get more out of the app, can be a little annoying.', overall=3.0, summary='The Word of the Day', unixReviewTime=1375228800, reviewTime='07 31, 2013'}
{reviewerID='A32ZTSEBT3DFCA', asin='0912696591', reviewerName='Starjolie', helpful=[0, 0], reviewText='I use to cake decorate as a kid in 4H, this book was a great refresher. Helps me make gorgeous cupcakes for friends and family.', overall=5.0, summary='Good refresher', unixReviewTime=1385164800, reviewTime='11 23, 2013'}
{reviewerID='A257VVBEMOVM9H', asin='B004AHBBPW', reviewerName='D.Songer', helpful=[0, 0], reviewText='love the daily Bible verses each morning. I don't always have time to read the Bible for my Bible study group so being able to listen to the Bible or have it at my fingertips and when I have a moment is great', overall=4.0, summary='Love this app', unixReviewTime=1384646400, reviewTime='11 17, 2013'}
{reviewerID='A26T6WQ5GN4DUX', asin='B004AHBBPW', reviewerName='Erin Henry', helpful=[0, 0], reviewText='This app has everything you need. Daily scripture, bibles, devotionals. I look forward to it every day. I like that I can set it to come on automatically every morning.', overall=5.0, summary='My favorite bible app.', unixReviewTime=1390867200, reviewTime='01 28, 2014'}
{reviewerID='AO92VNPHURMGP', asin='0912696591', reviewerName='Twilie', helpful=[0, 0], reviewText='great book, so many fun ideas..can't wait to get startedgreat product, fast shipping.I love the Wilton books and will keep buying them', overall=5.0, summary='nice', unixReviewTime=1383004800, reviewTime='10 29, 2013'}
{reviewerID='A3DGMGE0PPVPUW', asin='0912696591', reviewerName='Winter', helpful=[0, 0], reviewText='with four kids I'm really getting into doing their own cakes for their birthdays.... along with doing some side work... this book is awesome for ideas!!!', overall=5.0, summary='Love this book', unixReviewTime=1363132800, reviewTime='03 13, 2013'}
{reviewerID='A7PXDJVDK04HG', asin='B004AHBBPW', reviewerName='Gail Pawelski', helpful=[0, 0], reviewText='This app gives me the motivation needed to meet the day.  A reading from the Good Book always puts me in the proper mind set.', overall=5.0, summary='great start to my day!', unixReviewTime=1367020800, reviewTime='04 27, 2013'}
{reviewerID='A39T6YAK7CW7I2', asin='B004AHBBPW', reviewerName='Garry', helpful=[0, 0], reviewText='Great app for Christians. You will enjoy this app and enjoy the choices you have. One of my favorites! I love this app.', overall=5.0, summary='GREAT APP', unixReviewTime=1376524800, reviewTime='08 15, 2013'}
{reviewerID='A1KADP520MN19F', asin='1223070743', reviewerName='Amazon Customer', helpful=[0, 0], reviewText='Bag tore with almost nothing in it - Just caught the corner of a small cracker box and that was that. Pretty disappointed.', overall=2.0, summary='Tore rather easily', unixReviewTime=1391558400, reviewTime='02 5, 2014'}
{reviewerID='A38X1YNJFR07C', asin='B004AHBBPW', reviewerName='gmalinda', helpful=[0, 0], reviewText='I am using this app as part of my morning devotionals.  Perfect combination of verse, daily Bible reading, and devotional.  I have others I do, but save this for the last one as I really enjoy it!', overall=5.0, summary='love this app', unixReviewTime=1390780800, reviewTime='01 27, 2014'}
{reviewerID='A1XV1NMGYGJ1H3', asin='1223070743', reviewerName='Bettie', helpful=[0, 0], reviewText='Nice quality bag! Vibrant colors. Worth it!', overall=5.0, summary='Nice bag', unixReviewTime=1404345600, reviewTime='07 3, 2014'}
{reviewerID='A7KDU1JALDMLK', asin='1223070743', reviewerName='blah2012', helpful=[0, 0], reviewText='I'm a Star Wars fan and I bought this with the intention of using it for groceries but it turned into my new diaper bag. It's huge! I can fit everything i need in it where before I had my diaper bag and another bag and my purse. It has started to come apart on the side but I can sew it or order a new one it's so cheap. I am sure the intended purpose isn't for it to be used as a diaper bag daily but it works and I have gotten compliments on it even! It goes great with my Star Wars Vans too :D', overall=5.0, summary='I love this bag.', unixReviewTime=1403913600, reviewTime='06 28, 2014'}
{reviewerID='A2AL153DLI4QLA', asin='B004AHBBPW', reviewerName='Inez Abrams', helpful=[0, 0], reviewText='This App is important to me because I can cross references it with my study Bible. It is a great App.', overall=5.0, summary='Daily Bible', unixReviewTime=1368403200, reviewTime='05 13, 2013'}
{reviewerID='A1SMTHC8U7XUI3', asin='1223070743', reviewerName='Erin Boyle', helpful=[0, 0], reviewText='I got this for my bf and he loves it. The stitches on the sides failed so I had to re-stitch it. That held well but then the plastic lining on the sides ripped. My bf used it daily for several months before I had to replace it. Overall a good product but wish it was better made.', overall=4.0, summary='Love it but sides tear easily', unixReviewTime=1381881600, reviewTime='10 16, 2013'}
{reviewerID='A2VFH4B596XTTU', asin='B004AHBBPW', reviewerName='Jacquelyn George', helpful=[0, 0], reviewText='The Daily bible give me a verse to read and easy way to get to other chapters and verses.  It even let me read different bible version.', overall=5.0, summary='I look forward to daily verses, when I wake up each morning', unixReviewTime=1368489600, reviewTime='05 14, 2013'}
{reviewerID='A1N9ELULUQTH32', asin='1223070743', reviewerName='fitgirl46', helpful=[0, 0], reviewText='This makes a great reusuable gift bag for the Star Wars Fan. Well made and fun design for fans of the original movie.', overall=5.0, summary='Great gift bag', unixReviewTime=1380672000, reviewTime='10 2, 2013'}
{reviewerID='A24AAHG9B52FH8', asin='B004AHBBPW', reviewerName='Jenal', helpful=[0, 0], reviewText='There's Always Time for the Daily Bible.  I like this product because it's right there at your finger tips. Great!', overall=5.0, summary='DAILY BIBLE ... WHERE/HOW CAN YOU GO WRONG WITH THE BIBLE?!? It's right there at your fingertips!', unixReviewTime=1386806400, reviewTime='12 12, 2013'}
{reviewerID='A2DFUPV72KQDE7', asin='B004AHBBPW', reviewerName='Jenny J. "Jenny J."', helpful=[2, 4], reviewText='This app was actually very stupid and very boring.  Unless I missed something, its nothing but a blank screen with one verse written down.  You can't really do to much more then read the one small passage.  I deleted it after about a week.', overall=1.0, summary='Boring', unixReviewTime=1369008000, reviewTime='05 20, 2013'}
{reviewerID='A1WJ7JPOAGDK0R', asin='B004AHBBPW', reviewerName='Kari "Kari"', helpful=[0, 0], reviewText='I really love this app!  It's a nice way to have a daily scripture to ponder over.  There is also the option for more in depth scripture study which I also love.  I truly look forward to checking this app daily and it has added another nice source to help grow in my faith daily.', overall=5.0, summary='Wonderful app', unixReviewTime=1384041600, reviewTime='11 10, 2013'}
{reviewerID='A23DXQZ4E2WGQ', asin='B004AHBBPW', reviewerName='kim Lopez', helpful=[0, 0], reviewText=', Also has a share info port on screen to send same to family & friends.  I love that you can read whatever version you want,The writing is easy read.. Good Job!!!', overall=5.0, summary='Great for daily scriptures on the go.', unixReviewTime=1365724800, reviewTime='04 12, 2013'}
{reviewerID='AHYU3HZC09INS', asin='B004AHBBPW', reviewerName='Kiwi', helpful=[1, 1], reviewText='Thank you for providing an app that not only has a daily Bible verse but other preachers as well. Thank You', overall=5.0, summary='Great Read', unixReviewTime=1400112000, reviewTime='05 15, 2014'}
{reviewerID='A2JF13Z3H7009U', asin='B004AHBBPW', reviewerName='K. Kurtz "weary traveler"', helpful=[1, 1], reviewText='So many days I've been comforted and encouraged by this app! The customization options for study are terrific. If what you want is supplemental to your time in the Word, this app cannot be beaten!', overall=5.0, summary='Food for my soul!', unixReviewTime=1373414400, reviewTime='07 10, 2013'}
{reviewerID='A13QTZXOSEGJD8', asin='1567120709', reviewerName='JM Bunkin', helpful=[0, 0], reviewText='Works well but wish the display was just a bit larger. For the money it does what I want and I would buy it again.', overall=4.0, summary='Good for the money', unixReviewTime=1376006400, reviewTime='08 9, 2013'}
{reviewerID='ACFEJQ10MK905', asin='B004AHBBPW', reviewerName='Lady_Gforce', helpful=[0, 0], reviewText='I get to listen to different messages from a long list of preachers from Joel Olsteen, Joyce Meyer and Creflo Dollar. It is a spiritual tool I tap into more than once a day. This app also allows me to search chapters or verse and it can be read to me which is hard to find (in a human sounding voice)  .THIS IS MY GO TO APP FOR PODCASTS.', overall=5.0, summary='daily devotional is great.', unixReviewTime=1372723200, reviewTime='07 2, 2013'}
{reviewerID='A1Y1IE41K2NDT1', asin='B004AHBBPW', reviewerName='lcajuns', helpful=[0, 0], reviewText='Use this app nearly every day. I enjoy reading it and sometimes listening to the audio version. Handy to have many translations.', overall=5.0, summary='Great take along Bible', unixReviewTime=1389830400, reviewTime='01 16, 2014'}
{reviewerID='AN0H9QD7V7NND', asin='1567120709', reviewerName='mark a lawrence', helpful=[0, 0], reviewText='It works fine. The cover fell off after a few months. But it still works fine and was a good buy.', overall=3.0, summary='cover fell off', unixReviewTime=1388275200, reviewTime='12 29, 2013'}
{reviewerID='A3DURFM75XV494', asin='B004AHBBPW', reviewerName='Linda E DeBenedittis', helpful=[1, 1], reviewText='My son loves this and uses it daily on his little Tablet.  He has learning Disabilities and cannot read well without the Tablet's help and he enjoys reading (or having the Bible read to him daily!', overall=5.0, summary='Used by my son!', unixReviewTime=1393977600, reviewTime='03 5, 2014'}
{reviewerID='A3OLWJ8A3AP7Q9', asin='B004AHBBPW', reviewerName='Love2Read', helpful=[0, 0], reviewText='I have this on both my phone and Kindle Fire HD. I use it more on my phone. It requires WiFi or Internet, which makes it more usable on my phone. I love getting the verse everyday. I can search and read devotionals as well. It is a really nice app for on the go purposes.', overall=5.0, summary='Wonderful Daily Bible Verse', unixReviewTime=1377216000, reviewTime='08 23, 2013'}
{reviewerID='A134SOAMYBO1JZ', asin='1567120709', reviewerName='Shirley', helpful=[7, 9], reviewText='If you type the wrong word in, it &#34;might&#34; produce the correct word.  It doesn't give any explanation of the meaning or how it can be used. I should have sent it bk., but I factored in the cost of return shipping - wasn't worth the return.', overall=1.0, summary='It doesn't do much.', unixReviewTime=1373587200, reviewTime='07 12, 2013'}
{reviewerID='A7NGRREQ08GOA', asin='B004AHBBPW', reviewerName='Margie', helpful=[0, 0], reviewText='I am busy 24/7.  I am embarrassed to admit my quite time with God at times is less than 5 minutes a morning.  On those days this app comes in handy.  Also, some days I need a pick-me-up and this works every time.  I like how I can choose the version (NIV KJ NKJ etc)', overall=5.0, summary='Great for devotion on the go', unixReviewTime=1389139200, reviewTime='01 8, 2014'}
{reviewerID='AZV2U6GU5QA6C', asin='1567120709', reviewerName='Stephen R. Walker', helpful=[0, 0], reviewText='This one seems to be made better than my Seiko spell check. I like the cover on it as well.  SW', overall=4.0, summary='LOOKS WELL MADE!', unixReviewTime=1386547200, reviewTime='12 9, 2013'}
{reviewerID='A08839553NG2E57YWLLVC', asin='B004AHBBPW', reviewerName='Martin', helpful=[0, 0], reviewText='What a great blessing to have this to read each morning, each and everyday Gods Word right on my kindle, and different versions great work, t hank you thank you!!!', overall=5.0, summary='great blessing', unixReviewTime=1383177600, reviewTime='10 31, 2013'}
{reviewerID='A1FENMNIPDVJ42', asin='B004AHBBPW', reviewerName='Melissa C.', helpful=[0, 1], reviewText='I didn't like that you could select a version for you daily verse, but the daily reading defaults back to ESV, and you can't change it. I deleted it within a few minutes', overall=1.0, summary='Deleted it', unixReviewTime=1390521600, reviewTime='01 24, 2014'}
{reviewerID='AHGYYRYD5L22G', asin='1567120709', reviewerName='vegit', helpful=[0, 0], reviewText='I love to do crossword puzzles and this is a fun product to help me find or figure out those impossible clues. Yeah I know you can cheat and check out online answers but I prefer to challenge my grey matter.  I had one of these for years before it finally died (even with replacing battery it stopped working properly/easily). Hope it lasts again!', overall=5.0, summary='use to do crossword puzzles!', unixReviewTime=1391040000, reviewTime='01 30, 2014'}
{reviewerID='AVLQ8D3PTBKZF', asin='B004AHBBPW', reviewerName='Missy', helpful=[0, 0], reviewText='I love how it reminds me every morning to read my daily verse. I really love it!!!!!!!!!!!!!!!! This Bible is made for every type of Christian.', overall=5.0, summary='Daily Bible', unixReviewTime=1369699200, reviewTime='05 28, 2013'}
{reviewerID='A343J5M13FIY12', asin='B004AHBBPW', reviewerName='Mommato5', helpful=[0, 0], reviewText='I love this app. My favorite part is getting the reminder for the daily Bible verse in the morning. I also like being able to hear the scriptures, so if I don't have time to sit and read, I can be listening to God's Word!', overall=5.0, summary='keep The Word by you', unixReviewTime=1366848000, reviewTime='04 25, 2013'}
{reviewerID='A18FY8U26392XL', asin='B004AHBBPW', reviewerName='MsK', helpful=[0, 0], reviewText='I liked the Daily verse option.  However, the DailyPlan was hard to follow.  It does the job...I will keep it.  I am back to using my hands-on Bible though.', overall=3.0, summary='Everyday in the Word', unixReviewTime=1375747200, reviewTime='08 6, 2013'}
{reviewerID='A1JSPL43HCCEL9', asin='1891747401', reviewerName='Brandy', helpful=[0, 0], reviewText='Holds my law books up perfectly! The stand Also allows you to turn the pages for easy reading and use.', overall=5.0, summary='Great for Law Students', unixReviewTime=1376956800, reviewTime='08 20, 2013'}
{reviewerID='A36YFLNMZM4YGP', asin='B004AHBBPW', reviewerName='Nia Adero', helpful=[0, 0], reviewText='GET THIS APP!  If you desire to gain more knowledge about the Bible and to be able to do it on a daily basis, I would highly recommend this app because it keeps you on track and you can both read and listen to it either at home or in your car.  This is an awesome app also because it has several great features that make it better than other similar apps.  Unfortunately, you can't get this app for the Apple system, but if you have a Kindle or Android you are set.  I highly recommend it!', overall=5.0, summary='Daily Bible', unixReviewTime=1371945600, reviewTime='06 23, 2013'}
{reviewerID='A39H502I445I93', asin='1891747401', reviewerName='Diana and Bob', helpful=[0, 0], reviewText='Had my doubts that this would hold a 300 page paper back book because it's kinda thick and therefore stiff... NO Problem and the adjustable part of this holder is that the two parts that actually hold the book swivel so you can move them in or out to accommodate the size of book.... SIMPLE  BIG BOOK or small book it holds them all and the design allows for easy page turning.  I am using it to take notes for study.  Bought a much bigger holder at twice the expense and returned it... could not turn the pages.  This is a winner', overall=5.0, summary='It Holds any book and turning pages is easy', unixReviewTime=1397347200, reviewTime='04 13, 2014'}
{reviewerID='AFZYTVJ919HBR', asin='1891747401', reviewerName='George Everlast "G.Everlast"', helpful=[0, 0], reviewText='This thing rocks. It will hold your book where your want it to be. It will save your neck and keep you hands free to take notes or whatever as you read. It is super lightweight and convenient. I just keep it in my backpack at all times. It handles my 1000 page law books, so no worries in that department. The price is right. I see other people clunking around those huge, expensive wood book stands. This is way better. Go with this.', overall=5.0, summary='Must have for law student', unixReviewTime=1373414400, reviewTime='07 10, 2013'}
{reviewerID='A1VKUZ8A1GFI77', asin='B004AHBBPW', reviewerName='Patrice Morrison', helpful=[0, 0], reviewText='quick and easy to get to on my laptop. great for in a rush adn on the go love it', overall=5.0, summary='awsome', unixReviewTime=1374451200, reviewTime='07 22, 2013'}
{reviewerID='A1TNP7JCB7ZCGO', asin='B004AHBBPW', reviewerName='Phyllis Hildebrand', helpful=[0, 0], reviewText='I love it.  What else can I say.  Getting God's word every day, even from a tablet is the best.', overall=5.0, summary='Wonderful', unixReviewTime=1392508800, reviewTime='02 16, 2014'}
{reviewerID='A1NVRODFNKGAFH', asin='1891747401', reviewerName='J. Paine "JRBX"', helpful=[0, 0], reviewText='Want to pay upward of $50 for a thing to hold your Kindle while you read a recipe from it in the kitchen?I didn't either.So I bought this very simple, very inexpensive book holder.  And guess what?  Somehow it doesn't seem to recognize that the Kindle is NOT a book and can be easily tricked into holding a Kindle in much the same fashion as it would an actual book!!!!  Go figure.', overall=5.0, summary='Works great for Kindle!', unixReviewTime=1387843200, reviewTime='12 24, 2013'}
{reviewerID='A1P0N8BCXDJ114', asin='1891747401', reviewerName='K. Walfoort', helpful=[0, 0], reviewText='Holds even my Big study Bible well, and let me write my notes below it.  Great for Students.Looks too small to support a big book, but it does, and folds up light into my backpack', overall=5.0, summary='Love this for Bible Studies!', unixReviewTime=1377475200, reviewTime='08 26, 2013'}
{reviewerID='A3LH6T1MVUHN7D', asin='1891747401', reviewerName='Linda Adsit', helpful=[0, 0], reviewText='A good cookbook holder is a necessity for people who really cook as it keeps the book from falling off the counter, gives you more working space, and keeps drips and spills from soiling the pages.  I've used plate holders and even copy stands from the stationary store in the past, but this is the Real McCoy.  Very nice cookbook holder.  Good quality.  Even holds Joy of Cooking.  I'm glad I finally invested in one.', overall=5.0, summary='Great book holder', unixReviewTime=1373932800, reviewTime='07 16, 2013'}
{reviewerID='A1OCY3O072SHXH', asin='B004AHBBPW', reviewerName='Rasha', helpful=[0, 0], reviewText='I have this downloaded on my Kindle Fire and use it in church, it is so much easier to go to the different books of the bible', overall=5.0, summary='Daily Bible', unixReviewTime=1364515200, reviewTime='03 29, 2013'}
{reviewerID='AC09OIFJYTUQK', asin='1891747401', reviewerName='MF', helpful=[0, 0], reviewText='Quite steady when used with a medium to large size book. For small softcover I would use something else though!', overall=5.0, summary='Great!', unixReviewTime=1381104000, reviewTime='10 7, 2013'}
{reviewerID='A2OQN8YLOIOWHW', asin='B004AHBBPW', reviewerName='Renny', helpful=[0, 0], reviewText='I like the fact that it has audio as well and that I can read the daily plan in different versions.  I recommended this to my brother who has macular degeneration in both eyes and he thoroughly enjoys it as well.', overall=5.0, summary='I love it!', unixReviewTime=1389830400, reviewTime='01 16, 2014'}
{reviewerID='A1OGAQLOBZHKRE', asin='1891747401', reviewerName='RMS "RMS"', helpful=[0, 0], reviewText='Excellent product.  Efficient (including wide enough) for it's use.  Sturdy while not impeding the process of actually reading/viewing the book.', overall=4.0, summary='Mighty Bright Fold-n-Stow Book Holder', unixReviewTime=1384128000, reviewTime='11 11, 2013'}
{reviewerID='A3O2S5D3F6R1E3', asin='B004AHBBPW', reviewerName='richard gomez', helpful=[0, 0], reviewText='Great app!!!! I use it alot since I've had it..I just don't think there's any other app out there that has it all......!!!', overall=5.0, summary='"Good Job"', unixReviewTime=1385683200, reviewTime='11 29, 2013'}
{reviewerID='A1UDL0MEOR280L', asin='B004AHBBPW', reviewerName='Richie B.', helpful=[0, 0], reviewText='This app allows you to read and listen to the word during your devotions on a daily basis. While moving around or in one place you can listen to your favorite pastor sharing messages.  Your can listen anywhere and really immerse yourself in the word so that you enhance your understanding of the bible.Don't take my word for it. Try it out yourselves.', overall=5.0, summary='Great for the busy person', unixReviewTime=1383004800, reviewTime='10 29, 2013'}
{reviewerID='A2UTBD3OBHQ9S9', asin='B004AHBBPW', reviewerName='Rod', helpful=[0, 0], reviewText='This is one of the best Apps going for a daily bible guide that works well on the Kindle Fire. It is easy to start and has links that are just as easy to use for further depth if you want to pursue a topic. I really like it.', overall=5.0, summary='Excellent', unixReviewTime=1382054400, reviewTime='10 18, 2013'}
{reviewerID='A3QOAEXTCJAU13', asin='1983475912', reviewerName='Anna', helpful=[0, 0], reviewText='This mug is fantastic, it washes well, has a good weight, and can double as a nifty negotiation tool.  After all, who messes with a guy who has brass knuckles on his coffee mug?  Anyway, my husband has big hands and he says the knuckles are comfortable and easy to grip.  It arrived quickly and well packaged.  It's a winner, you won't be disappointed.', overall=5.0, summary='Only for the SERIOUS coffee drinker', unixReviewTime=1378771200, reviewTime='09 10, 2013'}
{reviewerID='A183THTONNNESL', asin='B004AHBBPW', reviewerName='R. Watson "public health diva"', helpful=[0, 0], reviewText='I love this app. It has a lot of variety to it in the way of speakers or podcasts, scripture verses and everything.', overall=5.0, summary='Great app!', unixReviewTime=1373155200, reviewTime='07 7, 2013'}
{reviewerID='AG88PJVD9RI74', asin='1983475912', reviewerName='Faith N', helpful=[0, 0], reviewText='I've been eying this cup for awhile now and finally broke down and purchased it. I took a chance and ordered one of the 'used' models (it hadn't been opened but the box had a little damage.) The cup was in perfect, pristine condition and was only $6 shipped. My husband also likes it but his fingers are far too big to fit in the holes (I have pretty small hands and they are snug in it.)', overall=5.0, summary='Awesome design', unixReviewTime=1400284800, reviewTime='05 17, 2014'}
{reviewerID='A2LHF3N99MNC7V', asin='1983475912', reviewerName='Lawrence K. Nelson "More on"', helpful=[0, 0], reviewText='Great concept but finger holes seriosly too small.', overall=4.0, summary='Four Stars', unixReviewTime=1404864000, reviewTime='07 9, 2014'}
{reviewerID='A9WFV9DEWY4S0', asin='B004AHBBPW', reviewerName='S. DAY "S M DAY"', helpful=[0, 0], reviewText='Pretty good Bible app if you have internet service.  Some of the information you may need to look up May not display if you are not connected online.  This is the first Bible app I tried, it is often difficult to manipulate the search engine.I have since found a much better Bible app in my opinion and much more user friendly but maybe someone might like this better.  This app just did not work for me.', overall=3.0, summary='Not For Me', unixReviewTime=1386115200, reviewTime='12 4, 2013'}
{reviewerID='A2USMIT2CSA08', asin='1983475912', reviewerName='Natalia Murataeva "Natasha"', helpful=[0, 0], reviewText='I'm very disappointed with this purchase. The quality of the product is low, the paint is uneven and the bottom of the cup is cheeped.', overall=2.0, summary='Ugly and of poor quality', unixReviewTime=1398988800, reviewTime='05 2, 2014'}
{reviewerID='A2ATVYD91DT40L', asin='B004AHBBPW', reviewerName='silverlistener', helpful=[0, 0], reviewText='Getting the daily verses are good.  Some days it hits home for that day.  Being able to find verses so quickly is wonderful.  I am still a hunter for some of the books of the Bible.', overall=5.0, summary='Daily verses', unixReviewTime=1369180800, reviewTime='05 22, 2013'}
{reviewerID='A1N1VHE9QWNOL9', asin='1983475912', reviewerName='S.Martinez', helpful=[0, 0], reviewText='I bought this for my boyfriend and he just loved it!It was really good quality for the money.Very cool mug.', overall=5.0, summary='Perfect gift!', unixReviewTime=1394236800, reviewTime='03 8, 2014'}
{reviewerID='A5T4UD17XHEDV', asin='B004AHBBPW', reviewerName='Soccer Mom', helpful=[0, 0], reviewText='So uplifting to get a bible verse on a daily basis.  Love the access to look up information when needed for bible study and the ability to have it read to you is a great feature.', overall=5.0, summary='Uplifting', unixReviewTime=1370217600, reviewTime='06 3, 2013'}
{reviewerID='A21GW4L8FO307V', asin='1983475912', reviewerName='Venom', helpful=[0, 0], reviewText='Almost works like it is supposed to. The finger holes are a little small and hard to release the cup if you use all 4 holes. Just use the top two  and the large hole with three fingers and it works great. Good Quality. I would Recommend this item. Great Price and fast shipping.', overall=4.0, summary='I like it.', unixReviewTime=1386028800, reviewTime='12 3, 2013'}
{reviewerID='A12YMJYQCBCN6K', asin='2042037265', reviewerName='Annette', helpful=[0, 0], reviewText='used it to make mini PB & J sandwiches for my 2 year old niece, havent used for cookies yet but am going to do so in a couple days, ordered the bigger mickey mouse for sandwiches cause this one was small, you dont realize how small 2 inches is till you cut out the shape', overall=4.0, summary='sturdy product', unixReviewTime=1397433600, reviewTime='04 14, 2014'}
{reviewerID='ATQ8DTTRJEQ8G', asin='B004AHBBPW', reviewerName='Teresa Dailey', helpful=[0, 0], reviewText='very straightforward, easy to use, plus the Daily Devotion are real time and up to date.With Joyce Meyer, Joel Olsten any other . The I like is from joyce Meyer's New book God's not mad at you.', overall=5.0, summary='Excellent App.', unixReviewTime=1378252800, reviewTime='09 4, 2013'}
{reviewerID='APDTC1NHW6UGT', asin='2042037265', reviewerName='Haylie', helpful=[0, 0], reviewText='I purchased this for my son's first birthday and the theme is mickey and it will make great fun mickey shaped cookies and fruit shaped Mickey's. Was a little smaller then expected but over all good product, durable and very cute.', overall=4.0, summary='very cute', unixReviewTime=1395619200, reviewTime='03 24, 2014'}
{reviewerID='A84Z17TJMDRW6', asin='B004AHBBPW', reviewerName='Terry', helpful=[0, 0], reviewText='I like this app.  It sends a reading to you each day, it will read the verse to you if connected.  Tabs include: Daily Plan ( various longer Bible verses that can be read to you), Devotion tab (recordings of various speaker talks on different subjects), and a final Search tab (you can enter a book, chapter and verse and it will come up).  This is a very useful and  very friendly app.', overall=5.0, summary='I use this app daily', unixReviewTime=1390435200, reviewTime='01 23, 2014'}
{reviewerID='A30JYEX8DVTK3Q', asin='B004AHBBPW', reviewerName='theosdoren', helpful=[1, 1], reviewText='A Word each day from God's Word and so much more! It's free like Jesus frees a man from his sin.', overall=5.0, summary='A Word each day from God's Word and so much more', unixReviewTime=1394928000, reviewTime='03 16, 2014'}
{reviewerID='A6DE4SBDK1ZXS', asin='2042037265', reviewerName='Laila', helpful=[0, 0], reviewText='This cookie cutter is perfect for use with fondant and making impressions in buttercream icing to be traced over. At first it seemed off, meaning it was lopsided when placed on the table, but I was able to straighten that out. I received it super fast considering it came from across the country!  Overall, I'm pleased with the item and the seller.', overall=5.0, summary='Just what I needed', unixReviewTime=1393545600, reviewTime='02 28, 2014'}
{reviewerID='A2Z5DPMQ9RZWZF', asin='B004AHBBPW', reviewerName='tishamoore "Tisha Moore"', helpful=[0, 0], reviewText='VerseS Are Well Choosen And Mostly Just What I Need For That Day. Awesome Links To Podcasts, And A Really Good variety.', overall=5.0, summary='daily Bible verse', unixReviewTime=1373328000, reviewTime='07 9, 2013'}
{reviewerID='A1UQ6TV2BL0XCW', asin='B004AHBBPW', reviewerName='Toby', helpful=[0, 0], reviewText='Downloaded to use when I go to church or Bible study. Easy to find scriptures and several version selections also', overall=5.0, summary='Good', unixReviewTime=1390089600, reviewTime='01 19, 2014'}
{reviewerID='A3FBUN1UFKJKXH', asin='7213035835', reviewerName='Gyropilot', helpful=[0, 0], reviewText='I was leery about spending tis much for the Tupperware brand name product, but I wanted to upgrade to covered ice cube trays for use in our RV and didn't feel comfortable with some of the negative reviews I read of lower cost brands (mainly the plastic cracking after a few months use).  Now that I've been using these for several weeks I'm thrilled at the fit, finish, and quality of the Tupperware product and feel the extra cost is worth it.  The best part is no more spilled water when loading the trays into the tiny freezer in our RV!  I've already gotten tossed out the original open plastic ice cube trays which were just aggravating.', overall=5.0, summary='Expensive but Worth It!', unixReviewTime=1378598400, reviewTime='09 8, 2013'}
{reviewerID='A35FITNL2CCTEE', asin='B004AHBBPW', reviewerName='Tracy Fettinger', helpful=[0, 0], reviewText='The podcast devotionals are great pick me ups, or when attending church is not an option. I also love the verse of the day part.', overall=5.0, summary='lovely app', unixReviewTime=1371686400, reviewTime='06 20, 2013'}
{reviewerID='A1RV9UBHXPXT3W', asin='7213035835', reviewerName='Kimberly Fujioka "the professional editor"', helpful=[0, 0], reviewText='When I first discovered this Tupperware ice cube tray, I was delighted. The ice stays large even with a frost free refrigerator. The cube compartments are easy to fill with the hole in the lid and as you walk to the freezer the cover prevents spilling.The MOST CRITICAL aspect is taste and smell. Since there is a lid, the ice never has a smell or taste even if you have frozen fish in the freezer like I usually do. I have four of these ice cube trays because we live in Hawaii where it is always hot and we constantly need ice for our drinks.Since I first discovered these ice cube trays I have never used the kind with no lid. These are by far better and less messy.', overall=5.0, summary='My favorite ice cube tray!!!', unixReviewTime=1377475200, reviewTime='08 26, 2013'}
{reviewerID='AO7XT4L9OOVIA', asin='B004AHBBPW', reviewerName='Vicky', helpful=[1, 1], reviewText='I love that a quote from the Bible pops up everyday while I'm in the middle of doing something else. It allows me to stop and reflect on the Word.', overall=5.0, summary='The Daily Bible is something I use almost every day.', unixReviewTime=1395273600, reviewTime='03 20, 2014'}
{reviewerID='A2KO26RP8CB8ON', asin='7213035835', reviewerName='Ruth', helpful=[0, 0], reviewText='These ice trays are awesome!  Highly recommend!!  Keeps ice contained and fresh!!!  Definitely worth purchasing even if they cost a little more than other brands.  I have used the same ones for over 10 years and they still aren't showing any signs of wear.  Good quality!', overall=5.0, summary='Ordered before, and now ordered some more', unixReviewTime=1378080000, reviewTime='09 2, 2013'}
{reviewerID='A33B7E8PMGUKXL', asin='7213035835', reviewerName='TripleJ', helpful=[3, 3], reviewText='I purchased these to freeze baby puree and they work great. With the covers, the puree will not be contaminated by other odors in the freezer. The cubes come out easily too, just need a twist by holding both ends of the tray and they will loosen up.', overall=4.0, summary='Good for storing baby puree', unixReviewTime=1380499200, reviewTime='09 30, 2013'}
{reviewerID='A1BD5XT3EE7VWU', asin='7502151168', reviewerName='Amazon Customer', helpful=[0, 0], reviewText='I like the handle length on these and the added bonas of not having to use my nails for the pith removal. I have had the finger ring style, Already gave 2 away, Hope I don't loose them in DW.', overall=5.0, summary='Use these mostly and glad I found them again', unixReviewTime=1396137600, reviewTime='03 30, 2014'}
{reviewerID='A1VS3V4KTJQ0XX', asin='7502151168', reviewerName='Diane Hoffbauer', helpful=[1, 1], reviewText='Months later we are still using this inexpensive set of citrus peelers to help kids peel their oranges in our school lunchroom.  Good purchase!', overall=5.0, summary='citrus peeler', unixReviewTime=1362873600, reviewTime='03 10, 2013'}
{reviewerID='A2O3KCIY79WCO2', asin='7502151168', reviewerName='Island Gal "happycampers"', helpful=[0, 0], reviewText='I needed just one more of these but this set was too good to pass up. I like having more that one color too.', overall=5.0, summary='Just what I hoped for!', unixReviewTime=1364169600, reviewTime='03 25, 2013'}
{reviewerID='A2O061NXCDPX7H', asin='7502151168', reviewerName='Leslie Herger', helpful=[0, 0], reviewText='This allows me to score an orange before slicing off the rind to make perfect garnishes for mixed drinks. Damn, I never had such perfect Old Fashioned until now.Also will unzip the skin of an orange so you can eat it, not just add it's skin to adult beverages.', overall=5.0, summary='Orange Unzipper', unixReviewTime=1393545600, reviewTime='02 28, 2014'}
{reviewerID='A1VICFJYF0NK83', asin='7502151168', reviewerName='Norma M. Wells "NorNor"', helpful=[0, 0], reviewText='Sure does save on the fingernails when I peel my oranges with this handy little gadget and love not have to go to a party to get it, Thank you Amazon.', overall=5.0, summary='Great', unixReviewTime=1391817600, reviewTime='02 8, 2014'}
{reviewerID='A3KVL2YQSRRF6X', asin='7502151168', reviewerName='queenofaz "melissa"', helpful=[0, 0], reviewText='if you have never used one of these to peel an orange or any citrus you do not know what you are missing. they last for ever and work every time', overall=5.0, summary='great tool', unixReviewTime=1390867200, reviewTime='01 28, 2014'}
{reviewerID='A2CCJVE96Z6JWX', asin='7502151168', reviewerName='swebb', helpful=[0, 0], reviewText='I always seem to lose my orange peeler.  Was good to buy more, but was very disappointed at the lack of color in what I purchased, several back and a couple of ble in the set of six.  Good product but when all colors are shown, that is what I thought I was buying', overall=4.0, summary='Liked the product', unixReviewTime=1397865600, reviewTime='04 19, 2014'}
{reviewerID='A2FSU0FOYLVBU3', asin='7535549756', reviewerName='Demeter', helpful=[0, 0], reviewText='These Tupperware Smidgets hold approximately 1-ounce. They are useful for storing small objects such as buttons, beads, scrapbooking items, paperclips, and similar items. At Tupperware parties, the Hostess recommends running the lids under hot water to loosen them up so they fit easily. If you do this, then they work well for carrying aspirin or vitamins.', overall=5.0, summary='Good buy!', unixReviewTime=1373241600, reviewTime='07 8, 2013'}
{reviewerID='A3CFH7IL0GL187', asin='7802215811', reviewerName='Gary P.', helpful=[1, 1], reviewText='Works great for storing anything you need to keep submerged in liquid in the fridge.  I typically use mine to store celery in water.', overall=5.0, summary='Works great', unixReviewTime=1368489600, reviewTime='05 14, 2013'}
{reviewerID='A2WJCE8VF3STFW', asin='7802215811', reviewerName='Judith', helpful=[0, 0], reviewText='Here in Penna. we make pickled eggs, also known here as red beet eggs.  I use this container for that.  The square shape makes it fit neatly in the back corner of my fridge.  The lid fits well; the strainer is sturdy.  I've had mine for five to ten years, and it is still good as new.  I just bought one for my mother.  She had her red beets eggs in a jar, which cracked spilling red juice all over the bottom of her firidge.  I have used mine to store asparagus with the ends in water to keep it fresh.  I think this would also work to marinate a few pieces of chicken.  I also know someone who uses hers, without the strainer, to store brown sugar.  So, it is a multi-purpose container.', overall=5.0, summary='Great for pickled eggs.', unixReviewTime=1388620800, reviewTime='01 2, 2014'}
{reviewerID='A2ABFKX8X7RRW9', asin='7802215811', reviewerName='no obama', helpful=[0, 0], reviewText='This container is larger than the one that I had previously. It will hold a 1/2 gallon of home made pickles with the liquid easily. Keeps them fresh and makes it easy to get your pickles out instead of having to leave them in the jar they were canned in', overall=5.0, summary='Pickle container', unixReviewTime=1373760000, reviewTime='07 14, 2013'}
{reviewerID='A35TBQ2YQ7Q5PF', asin='9177124405', reviewerName='Chelsea @ LPBA "Chelsea @ LPBA"', helpful=[0, 0], reviewText='Great set to start with or to fill in the gaps. No frill, and no damage after months of use. Very flat looking and simple.', overall=5.0, summary='Not too shabby', unixReviewTime=1395100800, reviewTime='03 18, 2014'}
{reviewerID='A3RHPBNP2N9RJB', asin='9177124405', reviewerName='Dolce Viognier "Dolce Viognier"', helpful=[1, 1], reviewText='Not bad for the price. I like the three pronged forks; it's fun and different. These are good for the price.', overall=5.0, summary='VEry Good', unixReviewTime=1387497600, reviewTime='12 20, 2013'}
{reviewerID='A2QVBRAC5EVJV3', asin='9177124405', reviewerName='Joy Ravona', helpful=[1, 1], reviewText='These are good because they are inexpensive, but they are not the most aesthetically pleasing and are very light weight.', overall=4.0, summary='You get what you pay for', unixReviewTime=1365724800, reviewTime='04 12, 2013'}
{reviewerID='AJ6G2SPCP6PUJ', asin='9177124405', reviewerName='Suizee', helpful=[0, 0], reviewText='The small spoon is too small. The bigger spoon is too big. Neither of them are true &#34;teaspoon&#34; size spoons. The flatware is very thin so the knife really has no cutting power (even for a butter knife) behind it. HOWEVER, for the price I paid, I can't expect anything else. They are pretty stylish at a glance but if you're looking to do anything that requires a durable utensil, this isn't the one you want.', overall=2.0, summary='Eh.', unixReviewTime=1365033600, reviewTime='04 4, 2013'}
{reviewerID='A15G2DK60FY1V1', asin='9177124405', reviewerName='tanner anjola', helpful=[0, 0], reviewText='You most definitely get what you pay for, these are very cheap and have already started to show signs of rusting after just a couple of months.  Also look carefully at the fork and knife, they are shaped quite differently than a regular set.  The fork also bends pretty easily which is not good when trying to eat a steak.  The spoons are also very disproportionate if you look at the little spoon it is way smaller than it appears in the picture.  I hate to say it but I was not impressed with Ikea in this case. I had to buy a whole new set to replace this one.', overall=2.0, summary='You get what you pay for', unixReviewTime=1401753600, reviewTime='06 3, 2014'}
{reviewerID='A2OIUYU1MG3XXL', asin='9178894395', reviewerName='Alissa', helpful=[0, 0], reviewText='I was hoping these cups would a little taller but they are perfect for my son so we are still very happy with them. I am still on the hunt for taller cups in these colors since I purchased the bowls and plates that match. Those are also a bit smaller than expected and work great for my son but they also do well for the adults.', overall=3.0, summary='pretty short for adults', unixReviewTime=1403308800, reviewTime='06 21, 2014'}
{reviewerID='A10R8DNMRWJURI', asin='9178894395', reviewerName='Allison', helpful=[0, 0], reviewText='perfect for my three year old triplets.  we have the bowls, cups, and plates from ikea and love them all', overall=5.0, summary='perfect', unixReviewTime=1388448000, reviewTime='12 31, 2013'}
{reviewerID='A1G6DY3E3DBJTS', asin='9178894395', reviewerName='babydollnut', helpful=[0, 0], reviewText='These are perfect for my home daycare,  perfect size for little hands,  compact to store,  and do great in the dishwasher multiple times a day!!  Get em!!', overall=5.0, summary='Toddler tumblers', unixReviewTime=1377129600, reviewTime='08 22, 2013'}
{reviewerID='A24VUKKAKYAOC0', asin='9178894395', reviewerName='busy mama', helpful=[0, 0], reviewText='I really love these. They are a great quality, perfect size, and the thicker weight of the plastic makes them feel just right when holding them. The lip/edge is curved enough so it doesn't feel sharp. They also have a pretty wide base, which I imagine helps them tip over less. My 2 year old does good with them, and I like to drink juice out of them as well.', overall=5.0, summary='GREAT kid cups', unixReviewTime=1396224000, reviewTime='03 31, 2014'}
