{reviewerID='A2HQWU6HUKIEC7', asin='B004A9SDD8', reviewerName='Audiobook lover "Kathy"', helpful=[0, 0], reviewText='Oh, how my little grandson loves this app. He's always asking for "Monkey." Grandma has tired of it long before he has. Finding the items on each page that he can touch and activate is endlessly entertaining for him, at least for now. Well worth the $.99.', overall=5.0, summary='2-year-old loves it', unixReviewTime=1323043200, reviewTime='12 5, 2011'}
{reviewerID='A1SXASF6GYG96I', asin='B004A9SDD8', reviewerName='Barbara Gibbs', helpful=[0, 0], reviewText='I found this at a perfect time since my daughter's favorite song at the moment is five little monkeys. It's easy for little ones to operate and fun with all the things you can play with. The different generes are nice too, gives its a little variety.  Worth the money. Highly recommended!', overall=5.0, summary='Fun game', unixReviewTime=1337558400, reviewTime='05 21, 2012'}
{reviewerID='A2B54P9ZDYH167', asin='B004A9SDD8', reviewerName='Brooke Greenstreet "Babylove"', helpful=[3, 4], reviewText='My 1 year old goes back to this game over and over again.  It is simple but very easy for a toddler to use.  I've even caught my 5 year old playing it as well.  Good app for little guys!', overall=5.0, summary='We love our Monkeys!', unixReviewTime=1354752000, reviewTime='12 6, 2012'}
{reviewerID='A331GYAT4ESYI3', asin='B004A9SDD8', reviewerName='Felicia', helpful=[3, 3], reviewText='THis is just so cute and a great app for little ones. My 16 mo old loves it. She thinks it's so funny and gets a kick out of the song.', overall=5.0, summary='so cute', unixReviewTime=1354665600, reviewTime='12 5, 2012'}
{reviewerID='A2MHCTX43MIMDZ', asin='0615391206', reviewerName='M. Johnson "Tea Lover"', helpful=[14, 18], reviewText='This book is a must have if you get a Zoku (which I also highly recommend). There is a large variety of recipes from simple, to fancy. The flavor combos are creative, and it gives you ideas for decorating the pops too. They turn out as beautiful as they are tasty. After reading it you will be inspired to create your own recipes too.', overall=5.0, summary='Creative Combos', unixReviewTime=1312416000, reviewTime='08 4, 2011'}
{reviewerID='A1SW2D234X11MS', asin='0615391206', reviewerName='savinggrace "savinggrace"', helpful=[2, 3], reviewText='This book is so beautifully illustrated and easy to follow. It helps you to understand the Zoku better. It might have been even better if they made the recipe units for different sized molds. These recipes produce too much for a single mold unit. It would have been nice if they used a matrix for the ingredients like on a box of rice. I am just math lazy and bought a single mold Zoku. Dividing 3/4 of a cup, 3 tablespoons or 3 1/2 tablespoons is kind of dicey in my kitchen.', overall=5.0, summary='Beautifully illustrated recipe and instruction book for Zoku pops', unixReviewTime=1341187200, reviewTime='07 2, 2012'}
{reviewerID='A1ZH5ULI4SBO48', asin='0615391206', reviewerName='S. G. "s.g."', helpful=[32, 39], reviewText='I bought this when I bought the pop maker. I think the recipes are fine, but there really isn't much in the book I wouldn't have figured out myself.A couple of good creamy recipes that are now available for free on recipe websites. As for "pop embellishing" well, that wasn't too hard to figure out, either. I'd save the money and spend it instead on extra pop sticks, which seem to disappear the way socks do....', overall=2.0, summary='Okay but you can figure it out yourself without the book', unixReviewTime=1323302400, reviewTime='12 8, 2011'}
{reviewerID='A1V13XAWO98C1J', asin='0615391206', reviewerName='Stan "Stan"', helpful=[13, 13], reviewText='The Zoku accessories are pricey, but the recipes have the exact amount you need to make the pops.  I have made it through 15 varieties so far, and I like them all.', overall=5.0, summary='If you have the Zoku maker, buy this!', unixReviewTime=1316649600, reviewTime='09 22, 2011'}
{reviewerID='A2BVT5QJSEEQI8', asin='0615391206', reviewerName='Steven Griffis', helpful=[3, 3], reviewText='The recipes in this books are tedious to make. I found that easier and simpler recipes can be found online. I had no problem with the recipes online working in the Zoku maker.', overall=4.0, summary='I liked this book, but........', unixReviewTime=1356480000, reviewTime='12 26, 2012'}
{reviewerID='A3R9X003XW0LNR', asin='0689027818', reviewerName='Deborah Verlen "Deborah"', helpful=[0, 0], reviewText='This beautifully illustrated book featuring ten colorful,glittery butterflies is a favorite at our house. The nana-babies like to count the butterflies as they flit off! The book is also good for learning colors, discussing the activities the butterflies do and the plastic butterflies are great as the babies and toddlers like to touch them!', overall=5.0, summary='A sweet book for babies and toddlers', unixReviewTime=1248652800, reviewTime='07 27, 2009'}
{reviewerID='AMZSUGQIAOH5O', asin='0689027818', reviewerName='jesssibs', helpful=[0, 0], reviewText='I got this as a gift for my niece and she loved it. It's a super cute book and ill be getting it for any other nieces that may come along.', overall=5.0, summary='Super cute niece present', unixReviewTime=1339027200, reviewTime='06 7, 2012'}
{reviewerID='A307YFSORUAXSQ', asin='0689027818', reviewerName='NYCPickyMom', helpful=[16, 16], reviewText='This book is absolutely beautiful. A brilliant bedtime story with vibrant colors and gorgeous illustrations. Each page teaches a different color and the illustrations boldly burst with that color. ..., is how the book starts off and we are then led all around this color dreamland. ...The butterflies in the book are popped out and sparkly. As we turn each page the color butterfly we are reading about disappears. Each page mentions the color twice and an animal. The last page reunites all the butterflies and the colorful animals as we say goodnight...My daughter loved this book since she was 4 months old. The colorful illustrations keep her interested and she likes to grab at the popped up butterflies. A delightful story I enjoy reading again and again. I sometimes even read it to myself. The purple page is MY favorite.', overall=5.0, summary='My Daughter's New Favorite', unixReviewTime=1045785600, reviewTime='02 21, 2003'}
{reviewerID='AELVL0VXR3VFN', asin='B004A9SDD8', reviewerName='PClark', helpful=[2, 2], reviewText='My granddaughter really loves this. She will listen to all 3 types of music with it and is not yet tired of it.', overall=5.0, summary='So cute', unixReviewTime=1353196800, reviewTime='11 18, 2012'}
{reviewerID='A55641MA1CS5F', asin='B004A9SDD8', reviewerName='Robert Daniels', helpful=[1, 1], reviewText='love it, but wish it was fullscreen on honeycomb. the songs and animations are quite catchy. great for any preschool teacher or parent of you guns.', overall=4.0, summary='love it', unixReviewTime=1313280000, reviewTime='08 14, 2011'}
{reviewerID='A2WNXS3CNAQS01', asin='0689027818', reviewerName='Sapere Aude', helpful=[1, 1], reviewText='My daughter 1 year old really likes this book.  I bought it because of its similarity to the 10 little ladybugs book.  It has the same sort of colorful illustrations and I like it better as the ladybugs are not as pretty as the sparkly butterflies.  This book teaches colors as each of the butterflies finds a place to stay for the night.Update - My daughter is now well grown but this book sticks in my mind still - we read it so many times.  I would say it was one of her very favorites when she was young.', overall=5.0, summary='My daughter loves it', unixReviewTime=1082592000, reviewTime='04 22, 2004'}
{reviewerID='A3ACPKNYVFJWRY', asin='B004AFQAUA', reviewerName='Altaira_Jade', helpful=[1, 1], reviewText='Great selections.  Easy to use interface.  I have playlists for everyone in the family (me, hubby, and 10 year old son).  Works great on the PC and my MP3 players (no Apple products tested).  Also use with Sonos and that interface is also simple to use.Only complaint is that you can't customize your plan.  I want 2 MP3 players and I'd have to pay for 3.  It's an extra $70 a year.  I would only pay $2 a month for the second player, so I got a huge capacity MP3 and share.  Easy to do with playlists.', overall=4.0, summary='Great service', unixReviewTime=1354060800, reviewTime='11 28, 2012'}
{reviewerID='A39RRTO760KGOY', asin='0912696591', reviewerName='Ahmed Montasser', helpful=[0, 0], reviewText='had no idea about decorating cakes,by this booklet ,now i can say that following the instructions and have the will and patience plus practicing,one day i wont be ashamed ofmy cakes. i added an image of a cake i made according to this book lessons, which i advice anyone who is interested; to get this book...', overall=5.0, summary='follow the instructions', unixReviewTime=1338076800, reviewTime='05 27, 2012'}
{reviewerID='A2ETSATXP9MTZ6', asin='B004AFQAUA', reviewerName='Amazon Customer', helpful=[1, 1], reviewText='I really don't think I could live without Rhapsody. I have it on my phone, my computer and my Kindle Fire. I use it everyday, no matter what device it is on, it works great. It is a wonderful way to take your favorite music and playlists with you wherever you go, whatever you do. Be aware that you do have to have a subscription and I'm pretty sure the price can range from $10 and up per month.', overall=5.0, summary='I love Rhapsody', unixReviewTime=1358553600, reviewTime='01 19, 2013'}
{reviewerID='AZF13R8HNB59E', asin='0912696591', reviewerName='ak', helpful=[0, 1], reviewText='excellent book, shipped on time, packaged nicely, helpful tips in the book, good price. Very good experience, very happy with the product and vendor', overall=5.0, summary='book', unixReviewTime=1339459200, reviewTime='06 12, 2012'}
{reviewerID='A3RYB7MYE6C8CB', asin='B004AFQAUA', reviewerName='Amazon Customer "I am 62 yrs. old....I love t...', helpful=[8, 10], reviewText='I love this app!! Yes,after 14 days you have to pay $9.99 a month....but this app has helped keep my sanity. It is the first app that Amazon has put out for music that I have liked. I  have tried over 100 apps. from Amazon and they asked for my opinion....here it is.Rhaspody has an extremely large array of music.I had no problem finding all the different artists and albums that I love. You can even download music to play off- line . I can listen to my music all day and night long.Please get this app....you,ll love it!', overall=5.0, summary='Rhaspody', unixReviewTime=1343260800, reviewTime='07 26, 2012'}
{reviewerID='A1KCBA3PKLV2IT', asin='0912696591', reviewerName='A. Lenz', helpful=[0, 0], reviewText='i loved it. don't use it much but when i had it's been useful. I recommend it to all who wants to learn how to decorate cakes', overall=5.0, summary='great!', unixReviewTime=1356480000, reviewTime='12 26, 2012'}
{reviewerID='A3JM7FVJMPJ1XD', asin='0912696591', reviewerName='Alli09', helpful=[4, 4], reviewText='So I actually bought this thinking it was the entire Lesson 2 kit. However, I've found through experience that having the book without having to take the class is a good thing. I've taken the Wilton Lesson 1 class and the number of Wilton items you have to purchase ALONG with the Lesson kit is a little ridiculous. I've worked my way through Lesson 1 and now I'm working my way (by myself) through lesson 2. I recommend anyone that likes to work on their own time to just purchase this book.', overall=3.0, summary='Good for what it's worth', unixReviewTime=1345075200, reviewTime='08 16, 2012'}
{reviewerID='A3SZDQ4JQH7T9S', asin='B004AFQAUA', reviewerName='Amy', helpful=[1, 3], reviewText='Tried to run this on my Kindle Fire; kept giving me message that I needed an updated flash player. When I tried to download, there were several selections, but none seemed to match my Kindle Fire settings and the ones I tried to download, didn't make Rhapsody work either. There seemed to be two ways to access Rhapsody; one took me to all this problem of the download and the other was the pay for it monthly option. I deleted all the downloads & Rhapsody app off my Kindle.', overall=1.0, summary='Very disappointed', unixReviewTime=1358035200, reviewTime='01 13, 2013'}
{reviewerID='A3S6DO7HX3YVMQ', asin='B004AFQAUA', reviewerName='BrianJ', helpful=[3, 3], reviewText='I have been a Rhapsody susbscriber for many years.  The service has been reliable and a good value, but the latest smartphone and tablet apps take it to a new level.  The UI is much improved, intuative, and brings recommendations and new releases once available only on the desktop software.  Good work!', overall=5.0, summary='Wow - V 3 rocks!', unixReviewTime=1352160000, reviewTime='11 6, 2012'}
{reviewerID='A36DVGJ18JV1E0', asin='0912696591', reviewerName='Amazon Customer', helpful=[2, 2], reviewText='This 128 page book contains pictures and patterns for 38 tiered cakes.  It gives you instructions on how to assemble cakes on stands, pillars or stacked construction.  It also contains recipes for basic scratch cakes in white, yellow, chocolate, strawberry, and banana.  It also has the recipes for standard Wilton Icings, fillings, glazes, fondant (not the tasty marshmallow kind), color flow, gum paste, and candy clay.  There are tips for baking, leveling, torting, filling and icing the cakes.  It also gives some instruction on how to cover a cake with fondant.  There are suggestions for transporting tiered cakes, calculating servings per cake and cutting guides.  The book also includes patterns and instructions for various decorations.  As with all Wilton books, the last few pages detail products you can buy from them to duplicate all the designs in the book.  The problem is that some of these items don't seem to be available on their web site any more.  The book was first published in 2005.  Still, it's a great idea book and I'm sure you can find acceptable substitutes for a lot of the items.  The book contains ideas for cakes that could be served at weddings, anniversaries, and showers.Also, I'm not sure if it's offered everywhere, but I'm currently enrolled in a class taught by a Wilton Instructor called "Tall Cakes".  It is taught in two sessions.  The first class is a demonstration by the instructor on how to put together a tiered cake.  The second class is where we bring in our own cakes and learn how to stack or pillar them.  It's less expensive than the other classes, no kit is required and the items needed are this book, one six-inch and one ten-inch layer cake, the plate/pillars, and our decorations.  It's a great way to top off the other four classes.', overall=5.0, summary='Great Idea Book and Used in Wilton Class', unixReviewTime=1346976000, reviewTime='09 7, 2012'}
{reviewerID='A2X4WC4ZRM0WTA', asin='0912696591', reviewerName='Amazon Customer', helpful=[2, 3], reviewText='didn't really care many of the cakes at all. not up to normal standing for wilton yearbooks of the past. the best cake is on the cover.', overall=2.0, summary='not the best', unixReviewTime=1343779200, reviewTime='08 1, 2012'}
{reviewerID='A11HCFWG0NRQY6', asin='B004AFQAUA', reviewerName='Cordelia Starnes', helpful=[1, 1], reviewText='I have been a therapist fan for years. it' s a great product. download as many songs as you want each month. super quick and easy. affordable.', overall=5.0, summary='Great Product', unixReviewTime=1356739200, reviewTime='12 29, 2012'}
{reviewerID='A2V3IKHRC7C1IA', asin='0912696591', reviewerName='Avuqagvik', helpful=[0, 0], reviewText='This book isn't much help if you are not taking the wilton cake decorating classes. you can get the basics but its really just a visual for the class!', overall=4.0, summary='good if you take a class!', unixReviewTime=1310256000, reviewTime='07 10, 2011'}
{reviewerID='A39SUI22Z4O4BM', asin='B004AFQAUA', reviewerName='dianabeld', helpful=[0, 0], reviewText='this app I do not use. and not sure how to get rid of it so I am stuck with it', overall=5.0, summary='rapsody', unixReviewTime=1359158400, reviewTime='01 26, 2013'}
{reviewerID='A2QXWOJN2NV3Z7', asin='B004AFQAUA', reviewerName='dmlasp', helpful=[15, 20], reviewText='I did the 7-day trial and was impressed, but am continuing my search for the best music app. Pros: tons of selection (but every music app has that); my account worked on the phone and online (at least for the trial; not sure if that applies afterwards); download to play off-line (while you have the service, obviously); decent UI (I made the buttons larger for in-car use); decent arrangement of genres with descriptions, key artists, key albums, key songs; info about artists is reasonably detailed; radio stations (though lots of music apps have those); tracking of songs played (though that seemed to be online only); recommendations are ok. Cons: songs did lots of skipping/jumping, even when I had 4 bars & 4G, and even online (though songs sometimes continued when coverage was bad); lacks the customization of thumbs up/down that I grew used to in Pandora; playlist UI isn't helpful - it shows a big view of the album of the currently playing song, then the list rolls of the screen, with no view of the upcoming song (you have to scroll all the way down the list); no lockscreen control; online there doesn't appear to be a way to create shortcuts to favorite radio stations; no scrobbling (there are some 3d party programs for online use). Will continue checking out Pandora, Tunewiki (really like the sync'd lyrics, when it works), Slacker, Winamp, Rdio, etc.', overall=3.0, summary='Good functions, but so many others do this and more', unixReviewTime=1307491200, reviewTime='06 8, 2011'}
{reviewerID='A1N766HHWQOS1N', asin='0912696591', reviewerName='Brendakperkins', helpful=[13, 14], reviewText='Any person that wishes to learn the art of making beautiful, real appearing, fondant/gum past flowers - this is the book for you!! I promise your flowers will look SO real that it will surprise people. Each and every little hint that helps you to make your flowers appear real is in this book! You cannot go wrong with this book. You will find yourself reading it over and over, makign flowers over and over. You will see that your self-esteem will roar! People, co-workers, family members, friends will be dazzled and amazed -- and so will YOU.  This lesson book is extremely valuable. It cannot be purchased from Wilton (which is a real crying shame). I think Wilton is afraid that if they sell the book, they will miss out of selling classes, but not so.  I, myself, took 4 classes. Having bakes/cooked since the age of 9, I really didn't feel it was necessary but boy was I surprised. I learned more in my first class than I had in years of teaching. Wilton honestly needs to sell these lesson plans.  Not only will receive money from the classes, but they will also make money from the books.  Why would a company prefer their customers buy their books from someone else??? I've not figured that out.  Getting back to this lesson book...you will be extremely, extremely happy.  Your family will brag on you.  Your income will increase for making beautiful live-appearing flowers that you sell on your cakes. Please try it...you cannot fail!!! Best book ever on making and decorating flowers!!', overall=5.0, summary='Wilton Flowers & Cake Design Lesson Plan', unixReviewTime=1297382400, reviewTime='02 11, 2011'}
{reviewerID='A3K1MGK7GNGC35', asin='B004AFQAUA', reviewerName='drummerj80', helpful=[1, 1], reviewText='I use this app so much at work and at home. Just find my favorite artist of the day and play their music while I work!', overall=5.0, summary='My music source!', unixReviewTime=1358985600, reviewTime='01 24, 2013'}
{reviewerID='A2RCIF60HF8NYT', asin='0912696591', reviewerName='Brightlights', helpful=[11, 11], reviewText='It took me about 40 minutes to read this lesson plan thoroughly; while it is inexpensive at under five dollars, I still don't know if that is necessarily a good value. As some reviewers have pointed out, much of the book focuses on advertising Wilton products; without all of this the useful material in the book could have been condensed down to a couple of pages. I did like the photographs and the techniques for making different consistencies of buttercream for different uses. I had initially planned on getting the subsequent lesson plans as well, but I don't think it will be worth it. If you have any skill/experience with cake decorating at all, I'd recommend skipping this book.', overall=3.0, summary='Okay', unixReviewTime=1334275200, reviewTime='04 13, 2012'}
{reviewerID='ATJ22NADXNLD9', asin='0912696591', reviewerName='Cardona "Cosmopolitana"', helpful=[1, 1], reviewText='I love this booklet! It is light and slim so its easy to have around and it has great pics to reference to in a hurry.', overall=5.0, summary='Great reference book!', unixReviewTime=1304899200, reviewTime='05 9, 2011'}
{reviewerID='A21H24R60CHCQS', asin='0912696591', reviewerName='celestemax', helpful=[0, 0], reviewText='I loved the book, very complete, detailed, clear instructions and easy to learn procedures. It is a comprehensive guide, useful for success in the art of pastry', overall=5.0, summary='Wonderful book', unixReviewTime=1319587200, reviewTime='10 26, 2011'}
{reviewerID='A2GN7AZE8QLLVU', asin='0912696591', reviewerName='Claire B. Stevens', helpful=[0, 0], reviewText='Even this is the 2nd course, it is easy to follow. I love the results. I don't sell cakes but make them for friends and family. This is only a hobby so I don't make cakes everyday. I can pick this book up and follow the directions and get great results.', overall=5.0, summary='New at this.', unixReviewTime=1355443200, reviewTime='12 14, 2012'}
{reviewerID='A31Q2IJFLNTTWT', asin='B004AFQAUA', reviewerName='H. Johnson', helpful=[0, 1], reviewText='Apparently my home subscription of Real Player wasn't good enough to stream on my Android device.  Required subscription upgrade (similar to Sirius/XM)', overall=2.0, summary='Subscription player', unixReviewTime=1318377600, reviewTime='10 12, 2011'}
{reviewerID='A27H3Z4H4SMD1X', asin='B004AFQAUA', reviewerName='Huntrr7', helpful=[5, 8], reviewText='You cant use this unless you have a PAID account. and if you do, it can only go to 3 computers/kindles (whatever). anymore you will exceed your limit. THIS STINKS', overall=1.0, summary='You cant even use it!', unixReviewTime=1355270400, reviewTime='12 12, 2012'}
{reviewerID='A3C1PNYWYQAM65', asin='0912696591', reviewerName='Clem'sMom', helpful=[0, 0], reviewText='Finally, I am taking the third (and most fun!) Wilton class at my local Joan Fabric store and I am loving this book!  One look at the cover, and I was "in."  This book explains the gum paste and fondant techniques beautifully, with very well photographed examples.  I recommend this book most highly with its inspiring and easy-to-follow instructions.', overall=5.0, summary='Review of the Wilton Gum Paste and Fondant Lesson Plan', unixReviewTime=1331942400, reviewTime='03 17, 2012'}
{reviewerID='A2PI8FRSA5Z9C5', asin='B004AFQAUA', reviewerName='James Maloney', helpful=[0, 1], reviewText='I love it, it works great as a mobile radio app. I've been able to use Rhapsody for a year and the product and app are defiantly recommended.', overall=4.0, summary='Great app for Rhapsody users', unixReviewTime=1355356800, reviewTime='12 13, 2012'}
{reviewerID='AGR0MOEYP1EBX', asin='0912696591', reviewerName='CraftingMama', helpful=[0, 0], reviewText='This Wilton book is awesome.  My local craft shop did not offer the fondant course when I wanted to take it so I decided to teach myself.  I followed the lessons in the book and my fondant cakes have improved greatly.  In my area the Wilton Method instructors are not so great so I am happy I was able to save the money on the class but still get all of the wonderful Wilton advice.  I would definitely recommend not only buying this book, but seeing how much you can teach yourself before spending the money on the class.', overall=5.0, summary='Awesome  book', unixReviewTime=1350604800, reviewTime='10 19, 2012'}
{reviewerID='AD0AO0OQP4X9P', asin='B004AFQAUA', reviewerName='J. Bowling', helpful=[0, 1], reviewText='Ipad and Ipod Touch versions are much better. App can be hard to navigate at times and seems more like a mobile site than a convenient app.', overall=3.0, summary='Needs Improvement', unixReviewTime=1356739200, reviewTime='12 29, 2012'}
{reviewerID='A2AMY0OOGMZHW5', asin='B004AFQAUA', reviewerName='jdel97', helpful=[1, 6], reviewText='why would you want to get a free app and but then have to pay 10 bucks a month to use it?', overall=1.0, summary='i dont get it', unixReviewTime=1333065600, reviewTime='03 30, 2012'}
{reviewerID='A2037NIGZSVPTQ', asin='0912696591', reviewerName='Cynthia Henderson', helpful=[2, 2], reviewText='I got this for my daughter in law. She loves it. Is shows how to use all the tools in the kit.', overall=5.0, summary='Wilton products', unixReviewTime=1293494400, reviewTime='12 28, 2010'}
{reviewerID='A1MMOO9F6U6JQN', asin='0912696591', reviewerName='David Kahle "Super Chef"', helpful=[62, 64], reviewText='I bought this book to help me out with decorating cakes and cupcakes as a beginner. I have found this book to be an excellent reference for the first time decorator. I ended up buying two different tips that did not come with my cake decorating set, that I have found very useful. I bought the cake curved spatulas, from Amazon,that work very well. I also bought the bench knife, and found a 16" cake lifter, and a 18" cake leveler. I got all these great ideas from this book. I bought other things in the book from Amazon, however, the list goes on too long to keep mentioning everything. Buy the book, great starter outer! Oh yes, I always take a look at all of the good and not so good reviews for every product I purchase from Amazon.comSincerely,Super Chef David', overall=5.0, summary='Wilton Decorating Basics Lesson Plan', unixReviewTime=1296432000, reviewTime='01 31, 2011'}
{reviewerID='A1XDCE3MFNX9TN', asin='B004AFQAUA', reviewerName='Leonard L. Volk', helpful=[1, 1], reviewText='I had Rhapsody acct. on my computer before I bought my Kindle Fire.  It os very easy to use to find songs, vocal groups, or genres of music and the dowhloads are fast and easy to transfer to mp3 players or the Kindle Fire.', overall=5.0, summary='easy to use', unixReviewTime=1355097600, reviewTime='12 10, 2012'}
{reviewerID='A3LAL62WZP8DGU', asin='0912696591', reviewerName='D. Goehner', helpful=[5, 5], reviewText='I saw this book at Target and flipped through it.  I was amazed at all the ideas to do with a simple brownie!  Granted what I make won't ever look as good as the pictures in the book, but I'm okay with that.  If I had sat down and thought about it I might have come up with some of these same ideas, but some of them are really clever.  I have had fun looking through the book with my kids and we are making brownie pops for my son's b'day treats at school and his party.PROS:- You can buy most of these supplies (including the book) at Michael's Craft Supplies or Joann's and like I said, I saw the book at Target with some of the molds.- creative uses for brownies.  Great way to have an easy-to-make but fun treats for all sorts of occasions.- there are suggestions for b'day's, sports, holidays, gifts...CONS:- You need to buy the molds or supplies to make any of special shapes so it's an investment up front.  Once you have them it's all about Brownie Fun!I think this book is a great resource (or a fun gift!) for any parent or person who likes to bake and be creative.', overall=4.0, summary='Great for kids or as a gift for a baker', unixReviewTime=1240444800, reviewTime='04 23, 2009'}
{reviewerID='A28NC9XJ5NS4Z', asin='0912696591', reviewerName='DVLISH14U', helpful=[0, 0], reviewText='Cake decorating has always been a hoby for me.  This book is excellent for us self taught decorators.  The pictures and how-to steps are great', overall=4.0, summary='Nice for Beginners', unixReviewTime=1358812800, reviewTime='01 22, 2013'}
{reviewerID='A3AGRNRIIYZ1PV', asin='0912696591', reviewerName='Elda', helpful=[0, 1], reviewText='I ordered this lesson plan because I took the first two courses of Wilton's Cake Decorating, and I didn't want to sign up for the 3rd course only because I didn't want to spend so much money for the classes. So I bought the kit in Michaels figuring I would teach myself but this time the lesson plan wasn't included in kit like the first 2 kits were. This lesson plan is great and if you have some experience with working with fondant and gum paste this will be a piece of cake for you, no pun intended. But this definitely isn't for a beginner.', overall=5.0, summary='Good Lesson Plan', unixReviewTime=1321574400, reviewTime='11 18, 2011'}
{reviewerID='A2REI6FI1KBIG3', asin='0912696591', reviewerName='Elisos', helpful=[0, 0], reviewText='It is a basic book for beginners and it is easy to understand.  It has a lot of ideas and I recommend it.', overall=4.0, summary='Basic', unixReviewTime=1344211200, reviewTime='08 6, 2012'}
{reviewerID='A1VO5Y77J1PKAE', asin='B004AFQAUA', reviewerName='M. McGinnis', helpful=[0, 1], reviewText='If only the software was better.As said, the service is amazing.  Competitors like Zune and Qriocity don't have a library anywhere near as deep as Rhapsody's.  But Rhapsody front ends on the Droid and the PC are sub-par.  The latest app update is better than the previous, but its still butt-ugly, and getting around feels harder than it needs to be.  They've added hi-def streaming to the latest version, and it sounds great.  A track still occassionaly drops, but I'm getting fewer of them now.Someone said that you need a higher priced subscription to use the PC software.  This isn't true, my 9.99/month subscription allows me to use the software on one mobile device and 3 PC's.But as far as the PC software goes, its simply awful.  Its supposed to handle downloads and transfers to your mobile device for offline listening, but I can't get it to work properly with my phone.  Its also hideously ugly (think old school Itunes).  Windows doesn't look like apple, so don't make an app that poorly emulates the look of an app that's already ugly.Great service...just wish they'd write better software, and hire someone who wasn't colorblind to build the interfaces.  Black and blue and gray...no real polish.Easy 5-stars if they bring their interfaces into the modern age, and make the PC version work right.  I've figured out how to download stuff to my phone for offline listening without the PC client, but a functioning client would make this so much more pleasant.They've released a web beta that looks pretty darn sharp--hoping they'll bring its look and feel down to the PC and Android soon and move the button/menu options around so I have less mis-taps.', overall=3.0, summary='If only...', unixReviewTime=1308700800, reviewTime='06 22, 2011'}
{reviewerID='ASHRHGXMGS6I5', asin='B004AFQAUA', reviewerName='Morgen', helpful=[0, 1], reviewText='I got a new Kindle and quickly started downloading a bunch of apps and books.  I downloaded this app and realized it wasn&#8217;t for me.  It bored me very quickly.  I downloaded the important ones from Amazon&#8217;s library and am content with what I have.  Not for me&#8230;but maybe you&#8217;ll like it.', overall=3.0, summary='It's Okay', unixReviewTime=1358294400, reviewTime='01 16, 2013'}
{reviewerID='A380P8LHEL3DZ9', asin='0912696591', reviewerName='Eve UrAlly "Ur Ally"', helpful=[0, 0], reviewText='Great set of lesson plans. I am thoroughly enjoying being able to learn at my own pace. Also, not ordering next book until I finish each book. Very motivating and thoroughly entertaining to all who are subjected to guessing what I actually made. LOL.', overall=5.0, summary='I am learning and these books are great', unixReviewTime=1360886400, reviewTime='02 15, 2013'}
{reviewerID='A1TXCLYGR3BE21', asin='0912696591', reviewerName='F. Huffman', helpful=[0, 0], reviewText='I love Wilton books they are always so attractive and enjoyable to browse through. I do believe over the years they have reduced the contents so you don't get to see as many examples of lovely cakes as the first books I bought back in the 70's. Still I have learned so much about cake decorating from them.', overall=5.0, summary='Beautiful Book', unixReviewTime=1342915200, reviewTime='07 22, 2012'}
{reviewerID='A3ASZ2P01CWR75', asin='B004AFQAUA', reviewerName='Prader "Praderwilli"', helpful=[0, 0], reviewText='This app is a widget on Android devices; works as an app on the Fire.  Easy to use, and provide reviews and information about the artists you listen to.', overall=4.0, summary='Nice interface and user friendly', unixReviewTime=1323734400, reviewTime='12 13, 2011'}
{reviewerID='A558YFSSD79ZK', asin='0912696591', reviewerName='F. T "Shop lover"', helpful=[0, 0], reviewText='It is very useful if you want to do flowers mostly.I was expecting more than just some pages, maybe I got it wrong but it is useful.', overall=4.0, summary='thought it was more than a manual', unixReviewTime=1315440000, reviewTime='09 8, 2011'}
{reviewerID='A2B7UV3A4GHASQ', asin='0912696591', reviewerName='GDQJF', helpful=[0, 0], reviewText='I love love love this book!! Not only does it give you ideas on how to decorate and what colors go good together ...it also shows how to make the decorations.', overall=5.0, summary='Baker's Dream!', unixReviewTime=1356566400, reviewTime='12 27, 2012'}
{reviewerID='A3QMDQHBDW2L9Z', asin='B004AFQAUA', reviewerName='Rachel', helpful=[0, 1], reviewText='Went looking for a app to listen to tunes on my Kindle fire.Tried a few free app,not my cup of tea).Like this 1 cause I don't have to take up a lot of space on my device.', overall=5.0, summary='tunes on my Kindle Fire', unixReviewTime=1356048000, reviewTime='12 21, 2012'}
{reviewerID='A1DITH5MFLJ5Z9', asin='0912696591', reviewerName='heathernicole', helpful=[0, 0], reviewText='GREAT FOR BEGINING!! has all the things you need there are very few things i dont use from this kit !! would recommend!', overall=5.0, summary='great!', unixReviewTime=1308528000, reviewTime='06 20, 2011'}
{reviewerID='A9XD85R3N4XV9', asin='0912696591', reviewerName='I. Ali', helpful=[2, 2], reviewText='I love everything of Wilton's. I bought this book to find out that I have the same one with just a different cover! But, it had a couple more ideas that I didn't have, great book, very simple to follow.', overall=5.0, summary='Wonderful book', unixReviewTime=1210896000, reviewTime='05 16, 2008'}
{reviewerID='A23ZUZTWTCTLWH', asin='B004AFQAUA', reviewerName='Rob A.', helpful=[1, 1], reviewText='For those of you who already have a Rhapsody subscription this is a good app to get.  As long as you can connect to the internet you can listen to your music without filling your devices storage space.  The interface is simple to use.  It needs a graphic equalizer and at nothing you can&#8217;t beat the price.', overall=3.0, summary='If you already have Rhapsody is a good app.', unixReviewTime=1357603200, reviewTime='01 8, 2013'}
{reviewerID='AS6NJVZEK3WE4', asin='0912696591', reviewerName='Jackie K', helpful=[2, 2], reviewText='This book is great for beginner fondant makers.  I was able to follow the instructions and tips and they helped a lot.', overall=5.0, summary='Great for beginners', unixReviewTime=1322352000, reviewTime='11 27, 2011'}
{reviewerID='A1P4DHRG58OSPS', asin='0912696591', reviewerName='JBo', helpful=[0, 0], reviewText='i learned how to make butter cream roses out of this book, very nice step by step instructions, easy to follow.', overall=5.0, summary='good!', unixReviewTime=1354838400, reviewTime='12 7, 2012'}
{reviewerID='A1CSQ8X7J57Q9K', asin='B004AFQAUA', reviewerName='Sarah A. Martin', helpful=[1, 1], reviewText='I have used this music source for a number of years and overall, they have a good variety ranging from Jack Hylton to Frank Sinatra to Black Ghosts. The only problem I had is that I had to keep the Caffine app on in order to get more than 30 seconds of a song which I found a little frustrating.  Still, a great way to hear some music from yesteryear and expand on your interests!', overall=4.0, summary='Decent but......', unixReviewTime=1355961600, reviewTime='12 20, 2012'}
{reviewerID='A924X0YFCCRSO', asin='0912696591', reviewerName='Jennifer', helpful=[2, 2], reviewText='This book is amazing! I love how Wilton publishes books for every stage of baking! This book is a must have for beginers!', overall=5.0, summary='Amazing!', unixReviewTime=1331078400, reviewTime='03 7, 2012'}
{reviewerID='A1VQBEW0G4IH1J', asin='0912696591', reviewerName='J-J-J-Jinx!', helpful=[4, 4], reviewText='I was a little disappointed in this book when I first got it. Since all you see on the cover is some "clown" cupcakes using the silly-feet baking cups (which I also purchased) I was expecting more uses of the silly-feet (I counted five), but it really covers whimsical cupcakes of all sorts, many of which would be suitable to make with children (easy to make).It's really just an idea book and a catalog of Wilton products and what you can do with them. There is a helpful section called "The Perfect Cupcakes; How to bake, ice and decorate", and there are about six pages of recipes. Most cupcake instructions are from 1/8 to 1/2 page long, right next to a big, clear picture.After getting over the "it wasn't what I expected" part of receiving this book, and seeing that my boyfriend seems rather enthusiastic about making really whimsical cupcakes and loves the silly-feet, I like this book more and more. Just don't expect anything sophisticated looking in it OR that many silly-feet ideas. If you are familiar with the typical adverbook that Wilton puts out, you shouldn't find any surprises here, and some of the recipes, which are a blend of from-a-mix and from-scratch, for the most part look very tempting.There are six pages of really cute Halloween cupcakes, including a vampire in a coffin, and some skeletons/ghosts/tombstones.', overall=4.0, summary='Typical Wilton adverbook', unixReviewTime=1192924800, reviewTime='10 21, 2007'}
{reviewerID='A1FX8395321MMU', asin='0912696591', reviewerName='Joann', helpful=[0, 0], reviewText='I had gotten all the other Wilton books so I cld teach myself how to these decoration ideas and lets just say that these books helped me so much.', overall=5.0, summary='Learned a lot', unixReviewTime=1343692800, reviewTime='07 31, 2012'}
{reviewerID='A22544DDR0RCH3', asin='B004AFQAUA', reviewerName='S. Majocha "Nursee13"', helpful=[0, 1], reviewText='I know this app has been out for a while but I just downloaded it.  It's easy to use I just have to remember that I have it on my kindle.  I can get used to it though.  And it's free.', overall=4.0, summary='Not bad!', unixReviewTime=1356739200, reviewTime='12 29, 2012'}
{reviewerID='AP0UZ5VMEHWF5', asin='B004AFQAUA', reviewerName='S. Suos "Heat"', helpful=[0, 0], reviewText='was a Napster subscriber when it joined rhapsody, now can finally use the service on my fire! there was no Napster app for the fire. anyhow,  great interface and music streams nice and clear!', overall=5.0, summary='great listening on the fire', unixReviewTime=1322697600, reviewTime='12 1, 2011'}
{reviewerID='A2YAA90FHU5X9J', asin='0912696591', reviewerName='kellkell024', helpful=[1, 1], reviewText='This lesson plan is a great companion to the Wilton decorating classes. I personally took the other 2 levels of classes in the series, but couldn't fit this one into my schedule, so I bought this lesson plan and theWilton Flowers and Cake Design Student Kitthinking I could learn on my own. I would consider myself an intermediate level decorator, and very good at self-study on many topics. But there were still some things in this book that it would be helpful to watch someone else do instead of teaching yourself - fortunately there are plenty of videos on the internet that helped me get through this. Overall, this is a great guide to decorating, but be prepared to do a little more searching on your own if you want to learn to perfect everything.', overall=4.0, summary='Good if you've decorated before', unixReviewTime=1314144000, reviewTime='08 24, 2011'}
{reviewerID='A2H86IUZS1LEH9', asin='B004AFQAUA', reviewerName='Tamara Moore', helpful=[0, 0], reviewText='Soo much easier than downloading music. I don't care about the 10 bux a month subscription. I get to listen to anything from comedy cd's by kevin hart, wheels on the bus for my son or the first beastie boys cd. It has everything.', overall=5.0, summary='absolutlely love this app.', unixReviewTime=1360627200, reviewTime='02 12, 2013'}
{reviewerID='A1R84BD41561V8', asin='0912696591', reviewerName='Kristi Gana', helpful=[1, 1], reviewText='This book was recommended by my cake decorating instructor. If you want to get started on cake decorating this is the book for you!', overall=5.0, summary='Great for the basics', unixReviewTime=1353542400, reviewTime='11 22, 2012'}
{reviewerID='A3VY71XCGEN48D', asin='B004AFQAUA', reviewerName='TONY MARTOCCHIO', helpful=[1, 1], reviewText='I have been a member of Rhapsody now for &#34;years&#34; ! I believe as for a recommondation &#34;years should say it all&#34;', overall=5.0, summary='MUSIC MUSIC MUSIC !!!', unixReviewTime=1362182400, reviewTime='03 2, 2013'}
{reviewerID='A326A1YITNYK5G', asin='0912696591', reviewerName='Linda Rivera', helpful=[0, 0], reviewText='Lots of interesting and helpful information for a beginner.  My daughter loves to bake and this will give her a opportunity to create much more.  Thank you!', overall=5.0, summary='I love it', unixReviewTime=1357084800, reviewTime='01 2, 2013'}
{reviewerID='A3IFPKRBIKDZPX', asin='B004AHBBPW', reviewerName='Aaron Meeks', helpful=[0, 0], reviewText='This is  a great! It pops up and you can devotions from a number  of people! but nothing is better that The scriptures daily!', overall=5.0, summary='Love it!', unixReviewTime=1353628800, reviewTime='11 23, 2012'}
{reviewerID='A1PT9URJ7A9VMP', asin='0912696591', reviewerName='Lo "EquineChick"', helpful=[0, 0], reviewText='I bought this because I haven't found time to take the class and found it's pretty easy to follow along and teach yourself everything in the book. There is step by step instructions for different designs and ideas and lots of hints and tricks for working with fondant and gumpaste.', overall=5.0, summary='Easy to follow lesson plan', unixReviewTime=1308960000, reviewTime='06 25, 2011'}
{reviewerID='ALYLJAU8IDT58', asin='0912696591', reviewerName='lovetodecorate', helpful=[0, 0], reviewText='Bought this book when I was hyped up and excited about baking and decorating cakes.  Although the designs are very outdated, it is very informative and I enjoy taking it out to view on occasion.', overall=5.0, summary='very entertaining', unixReviewTime=1339113600, reviewTime='06 8, 2012'}
{reviewerID='A3VZA10P366NSN', asin='0912696591', reviewerName='Lucia "lucia"', helpful=[4, 4], reviewText='I absolutely love this book! Before purchasing, I found myself gathering bits and pieces of information from the wilton site to make the flowers and borders that I wanted, but this book puts them all together neatly without leaving anything out. I recently purchased Colette's Cakes which is also wonderful, but so much of it is advanced, and I'm just not there. I only decorate for fun. This book sticks to basics which, for me, is essential to focus. If I see to much detail I tend to become frustrated and over anxious. Then I end up giving up. So, with this book I can actually follow the process and learn step by step without the frustration.The only small disappointment was the weight of the cover. The paper is a bit thin and will need some support or will probably not hold up very well. Nothing a little clear contact paper can't cure though, so no big deal.', overall=5.0, summary='Basics Are Covered....Beautiful Book', unixReviewTime=1280793600, reviewTime='08 3, 2010'}
{reviewerID='A2B02BTRVVFVMX', asin='0912696591', reviewerName='Luz', helpful=[0, 0], reviewText='I've always loved cake decorating, ever since I took my first Wilton class.  Gum Paste and Fondant seemed beyond my capabilities but when I saw this book I decided to give it a try.  The book is very easy to follow with lots of step by step pictures.  It's a lot of fun but, I admit, a bit frustrating.  No matter how closely I follow the steps, my creations never turn out exactly like the pictures.  I think part of the problem is that I'm a perfectionist at heart but....grrrr.....I can't fault the book, as all Wilton Lesson Plans, it's great.', overall=5.0, summary='Lots of Fun and Frustration!!!', unixReviewTime=1337644800, reviewTime='05 22, 2012'}
{reviewerID='A1SAOJ2WPUUBC5', asin='0912696591', reviewerName='Mable J. Rowan "Mable Jean Dixon Rowan"', helpful=[2, 2], reviewText='THIS WAS EYE CATCHING AND WHEN I ORDERED IT I KNEW I HAD TO HAVE IT. IT IS QUITE HELPFUL', overall=5.0, summary='PERFECT FOR BEGINNERS', unixReviewTime=1350518400, reviewTime='10 18, 2012'}
{reviewerID='A37WP9JXJ5XSC1', asin='B004AHBBPW', reviewerName='Amazon Customer', helpful=[0, 0], reviewText='Wish that It was easier to navigate in but for the most part a great app for the Bible.  Praise God', overall=4.0, summary='The Bible', unixReviewTime=1360108800, reviewTime='02 6, 2013'}
{reviewerID='A2RXBNM3QPHJD4', asin='B004AHBBPW', reviewerName='angiebc', helpful=[0, 0], reviewText='I first downloaded it on my cell phone. Enjoyed it so much I've recently downloaded it on my Kindle. I enjoy the daily verse as well as the other features it offers.', overall=5.0, summary='Geat App!', unixReviewTime=1357257600, reviewTime='01 4, 2013'}
{reviewerID='A20RILBV58QORD', asin='B004AHBBPW', reviewerName='A. Pietri', helpful=[0, 0], reviewText='I wish this had more versions. I love the daily verses and the ease of checking it but I like more background and history on the Word.', overall=3.0, summary='Good but no history', unixReviewTime=1361923200, reviewTime='02 27, 2013'}
{reviewerID='A19NPV406NQY1F', asin='B004AHBBPW', reviewerName='B. Brown', helpful=[0, 0], reviewText='I downloaded the bible app for my kindle fire and I also have it on my phone. The app is so great! I dont have any problems with anything. I love listening to the podcast. Joyce Meyer is my favorite.', overall=5.0, summary='Amazing bible app', unixReviewTime=1338595200, reviewTime='06 2, 2012'}
{reviewerID='A7P4OQ7V20N0E', asin='0912696591', reviewerName='MEM', helpful=[0, 0], reviewText='What a great book to help you get started on learning to decorate cakes. Very usful! Highly recommend buying this!', overall=5.0, summary='Big Help', unixReviewTime=1347753600, reviewTime='09 16, 2012'}
{reviewerID='AR9OIGY3T6EU7', asin='0912696591', reviewerName='M. Genei "twin mom"', helpful=[0, 0], reviewText='If you've ever looked through a Wilton year book and said &#34;I want to make that cake&#34; then you need this pattern book too!  This book includes patterns for many of the cakes in the yearbook.', overall=5.0, summary='Must have', unixReviewTime=1357430400, reviewTime='01 6, 2013'}
{reviewerID='A39X88W9MVXB1J', asin='B004AHBBPW', reviewerName='calmedcooled', helpful=[0, 0], reviewText='Great app. I enjoy seeing the random daily verses.  The podcasts are the best.  One of my favorite evangelists, Joyce Meyer, is on there.', overall=5.0, summary='Awesome. Inspirational. Reflecting.', unixReviewTime=1358121600, reviewTime='01 14, 2013'}
{reviewerID='A22S9JW4YAPEAP', asin='B004AHBBPW', reviewerName='Catarina73', helpful=[0, 0], reviewText='Very versatile app for daily reading of the bible.  Different reading plans offered.  Helps me work on my daily reading.  I like the fact that I don't have to carry around a paper copy book!', overall=5.0, summary='versatile app for daily reading of the bible', unixReviewTime=1337817600, reviewTime='05 24, 2012'}
{reviewerID='A72QEHDVRNTBC', asin='0912696591', reviewerName='Mujnmom', helpful=[1, 1], reviewText='Good guide for beginners.  Helpful resource.  Clear pictures and instructions.  If you can learn from just looking at a page on a book with a few written details, it will teach you without expensive classes.  But if you are using in addition to the class, all good too.  Keep it handy to look back at once in a while as a resource.', overall=4.0, summary='very good very helpful', unixReviewTime=1360540800, reviewTime='02 11, 2013'}
{reviewerID='A27ULPK1RGCNU6', asin='0912696591', reviewerName='Picky CO Mom', helpful=[2, 2], reviewText='I got this book for my daughter as the local craft store wouldn't let her take this class unless she took the other two first which she doesn't need. The book is full of color pictures so very well illustrated and the directions are clear and easy to follow. I also bought the class kit to go with it and it works great. would recommend for people wanting to learn how to do this on their own at home without a class.', overall=5.0, summary='great book for beginners', unixReviewTime=1316563200, reviewTime='09 21, 2011'}
{reviewerID='A1H4IVXNXWWBLV', asin='B004AHBBPW', reviewerName='Chilehead Photography "Captured Moments are t...', helpful=[96, 107], reviewText='This app is great!  It has a daily verse, a daily reading plan and then a whole list of daily devotionals, both audio and written.  I usually check out the Our Daily Bread audio podcast from here instead of going to odb.org and read My Utmost for His Highest (no longer available! :-( But still appears in list for some reason).  There is also a place to seach the bible by verse or keyword.  Many of the popular versions are available including NIV, NKJV and NASB.  Is exactly what is says... a Daily Bible!  Thanks for this app!', overall=5.0, summary='Great resource with alot at your fingertips! (update)', unixReviewTime=1300924800, reviewTime='03 24, 2011'}
{reviewerID='A2H5PWKGS0EKY', asin='0912696591', reviewerName='R. Straw', helpful=[0, 1], reviewText='I needed this for my third Wilton's class, and it was cheaper on Amazon.com than in the store. It's part of the curriculum, so it's required. Whether it is good for skill development or not, I take my classes very seriously, and get alot out of them. I also believe in checking prices everywhere for the class supplies. Amazon was cheapest, and I received it in 2 days, free shipping, Amazon prime.', overall=5.0, summary='Needed For Class', unixReviewTime=1324598400, reviewTime='12 23, 2011'}
{reviewerID='A3F7SSPP2M257N', asin='0912696591', reviewerName='Sara12345', helpful=[0, 0], reviewText='I really like all the helpful information in this book. It even has a recipe to make your own buttercream icing. I'm glad I purchased this item on amazon.com', overall=5.0, summary='Nice Book', unixReviewTime=1299110400, reviewTime='03 3, 2011'}
{reviewerID='A37I92XUAWKX8R', asin='0912696591', reviewerName='S. Arnold', helpful=[2, 2], reviewText='This "book" is more like a brochure.. or one of those checkout cookbooks. It does have some basic tips in it but I surely wouldn't pay more than $5 for it!!', overall=3.0, summary='Not what I was expecting', unixReviewTime=1265068800, reviewTime='02 2, 2010'}
{reviewerID='A2AELP5F59JLQG', asin='B004AHBBPW', reviewerName='C. Scilley "Love to read"', helpful=[1, 2], reviewText='This app is a really worth getting if you love the Bible as I do.  It has a lot of great features.', overall=5.0, summary='Love this app', unixReviewTime=1339459200, reviewTime='06 12, 2012'}
{reviewerID='A39LEKO3GKOPJ2', asin='0912696591', reviewerName='shak', helpful=[0, 0], reviewText='I'm not expert baker but, the video was very basic. I want to learn how to decorate a cakeand I think they focused to much on the basics then teaching how to actually decorate the cakeand maybe show more examples of her decorating. not bad, but if you are looking for something more advance onactually decorating a cake. this is not for you. but if you are new to baking, this is perfect for you!', overall=3.0, summary='very basic!', unixReviewTime=1360108800, reviewTime='02 6, 2013'}
{reviewerID='A13BBPU9UBQXDR', asin='0912696591', reviewerName='Shannon L. Toohey', helpful=[9, 11], reviewText='This is an ok book for a new cake decorator. It recovers a lot of the stuff already covered in the instruction booklets (beginning cake decorating and flowers and borders) and gives some full cake ideas.I like the instructions and have been using them as a supplement to the instruction books to have ideas of decorations to practice. However, the cakes themselves are nothing super exciting.This is the sort of book you buy when you're starting out and use until you have the skills down pretty well - then you would probably never use it again. I just can't see myself pulling this book out for "cake decorating ideas" when there are so many better idea books out there.Honestly, if you weren't getting this on a 4-for-3 promotion or it was on sale for about 10 bucks I wouldn't bother with it.', overall=3.0, summary='Ok, but nothing super exciting', unixReviewTime=1280793600, reviewTime='08 3, 2010'}
{reviewerID='A1ONTZMN48Z659', asin='0912696591', reviewerName='Sonia Deluna "cakes"', helpful=[1, 1], reviewText='Note, this is a small booklet..not a book. It's maybe 6 inches tall by 4 inches wide and about 15 pages. The pages are in color.It's not bad but I would not pay more than $3 for it.', overall=3.0, summary='You get what you pay for...kinda', unixReviewTime=1252022400, reviewTime='09 4, 2009'}
{reviewerID='A30W7YGP3FH844', asin='B004AHBBPW', reviewerName='djw746', helpful=[3, 4], reviewText='This is a great app for daily scriptures, the bible on the go, and inspiring podcasts.  There is also an audio button for those who cannot read.', overall=5.0, summary='Great mobile bible', unixReviewTime=1300838400, reviewTime='03 23, 2011'}
{reviewerID='A2JLC6JI8893TL', asin='0912696591', reviewerName='starpilot51', helpful=[0, 0], reviewText='This book shows you how to decorate different items. It explains the in's and outs of doing it.  Covers how to do different items.', overall=5.0, summary='Decorating Planner', unixReviewTime=1357603200, reviewTime='01 8, 2013'}
{reviewerID='AXN2MJGYO4QT6', asin='B004AHBBPW', reviewerName='D. Lewis', helpful=[2, 2], reviewText='The daily Bible by joansoft is hands down the best daily Bible app on the market, ANY market. I love the fact that it is extremely easy to use. My favorite feature is the share feature allowing the user to quickly and easily share the verse of the day to any social networking site. There is quick and easy links to a whole plethora of daily devotionals helping the user to develop their walk with God on a daily basis. I love this app and I have had MANY Bible apps but none can compare to what this one offers.', overall=5.0, summary='Best Bible App Out There', unixReviewTime=1320192000, reviewTime='11 2, 2011'}
{reviewerID='A23AKO4BZLZ8DE', asin='0912696591', reviewerName='stefanj', helpful=[0, 0], reviewText='THis book has been real helpful to my daughter.  She is just starting out and has made some really good flowers with this book.  A must if your into deco-ing.', overall=5.0, summary='One of Wiltons BETTER Books', unixReviewTime=1330300800, reviewTime='02 27, 2012'}
{reviewerID='A2A2E64XIULL97', asin='B004AHBBPW', reviewerName='elisha', helpful=[0, 0], reviewText='ok I don't have this version of the Bible app. I have the you version but anyway I read the reviews and am totally shocked!! do some people really not know what the Bible is and think its fiction!!! I am totally blown away by this. God is very real and he is our savior he also gave us free will. so you are free to choose your path and what you believe. however he loves us all anyway and should you ever come to God he will welcome you with open arms. God bless', overall=5.0, summary='wow', unixReviewTime=1346544000, reviewTime='09 2, 2012'}
{reviewerID='A20MA2M9PLAHRG', asin='0912696591', reviewerName='strongbear', helpful=[0, 0], reviewText='This product is of great quality. The product was very easy to use and it will have you making some beautiful decorations of flowers and other decorations. I highly recommend this seller for their speedy and excellent product.', overall=5.0, summary='very spring like cakes', unixReviewTime=1357862400, reviewTime='01 11, 2013'}
{reviewerID='A2BD12CY0NO0C4', asin='B004AHBBPW', reviewerName='Emmaleigh "eeyorefive"', helpful=[0, 0], reviewText='So far this it the best Daily Bible that I've found as a free app so far.  I've only been looking for about a week but so far I really like this one.', overall=5.0, summary='Very nice!!', unixReviewTime=1358726400, reviewTime='01 21, 2013'}
{reviewerID='A3IVBB1PNLK8SA', asin='0912696591', reviewerName='susieq', helpful=[1, 1], reviewText='I purchased this book without taking the course. Cake decorating classes in my area are almost nonexistent so I have to be self taught. Lots of pictures and detailed instructions will guide you through the beginning of cake decorating.', overall=5.0, summary='susieq', unixReviewTime=1325289600, reviewTime='12 31, 2011'}
{reviewerID='A2WSAWE6F95O6', asin='0912696591', reviewerName='sweetthing', helpful=[0, 0], reviewText='I have almost every Wilton Yearbook since 1977. I still use them and review the back issues frequently for ideas. I do do not like the newer issues as much because I do not care for fondant, so I love the older books.', overall=4.0, summary='Wilton 2012', unixReviewTime=1355184000, reviewTime='12 11, 2012'}
{reviewerID='A2UI4BE5U2NISG', asin='B004AHBBPW', reviewerName='Ex-Iowan', helpful=[1, 1], reviewText='I really love everything about this app.  I use it all of the time.  It gives you total access to the Bible.  Works great on the Kindle Fire.  I'm spoiled.  I'd be lost without it!!!!!  I mean that.', overall=5.0, summary='Great app!!!!', unixReviewTime=1341446400, reviewTime='07 5, 2012'}
{reviewerID='A2VWE5SGNDS8HW', asin='0912696591', reviewerName='tachi1 "tachi1"', helpful=[15, 15], reviewText='On the whole, I like this book very much. I have to say, however, that some of the instructions in it were contradicted by our instructor and she said she was instructed by Wilton to do so. I certainly felt that her way was better and, since it involves such basic instructions, I wanted to share it with you.For all the projects in this book other than covering the cake base and the cake itself--that is to say all the flowers, the bow, the leaves, and the borders along the bottom--wherever it says to use just gum paste, you should use a 1/2 gum paste and 1/2 fondant mix. Sure enough, it made it easier to do everything, there was less hardening and bumps, and everything looked prettier. (I had previously worked with gum paste on my own and wish I'd known this).Another thing that I noticed is that, in some cases, (especially the bow) the final product would have looked MUCH nicer if we'd made them thinner rather than as instructed in the booklet. It may be that, since this is an introductory course to forming decorations by sculpting rather than by piping, maybe they thought that thinner would have been harder to work with.But, all in all, it's a very nice reference (as well as an effective advertisement for countless Wilton products!)', overall=4.0, summary='Companion booklet for Level 3 Fondant & Gum Paste', unixReviewTime=1331596800, reviewTime='03 13, 2012'}
{reviewerID='A2FTFUIGAFL63Z', asin='B004AHBBPW', reviewerName='F. Bailey "NYC Black Christian"', helpful=[0, 0], reviewText='Works for the most part if you're reading, but I like to listen to the Bible while driving.  It's nice that it even has audio because none of the other free bible apps I know of offer that.  My only beef is that sometimes the audio works, and sometimes it doesn't.  I guess it's not the app's fault.  Probably has something to do with the Sprint cellular network I'm on.  I would have preferred to have an option to save the files on my phone as opposed to getting them off the web every time I open it.  That way I'd have instant access to it.  I gave three stars however because despite its problems, the price is right.', overall=3.0, summary='Can be frustrating at times', unixReviewTime=1321401600, reviewTime='11 16, 2011'}
{reviewerID='A22NAXLTEDT3UB', asin='0912696591', reviewerName='Zoraida Villanueva "Zodie"', helpful=[0, 1], reviewText='Easy to understand, great tips.  Learned alot and looking forward to creating the wonderful creations they show on the book.', overall=5.0, summary='Great book', unixReviewTime=1256256000, reviewTime='10 23, 2009'}
{reviewerID='A2EO5YH6CWK5V8', asin='B004AHBBPW', reviewerName='goats', helpful=[0, 0], reviewText='best biible app ever hay finallyvvvhhhjhhjjnnn b b b b b b b b b bjbbnbn nbn. n. Nb. j. b', overall=5.0, summary='awesome', unixReviewTime=1355356800, reviewTime='12 13, 2012'}
{reviewerID='A529YUMB096DX', asin='B004AHBBPW', reviewerName='Good Grief "-JJ"', helpful=[2, 2], reviewText='I use a different bible for scriptures. However this one has insightful scriptures for my wife and I to talk about and the daily plan that we can read during the day and talk about later. this app has helped is to be more insistent with reading the bible and praying together.', overall=5.0, summary='handy daily tool', unixReviewTime=1300838400, reviewTime='03 23, 2011'}
{reviewerID='A33NV98CA0Z419', asin='1223070743', reviewerName='D. Keeton "michealslove"', helpful=[0, 0], reviewText='It is perfect! I am using this bag as a gift bag for a guy's baby shower who is a die hard Star Wars fan! He will be able to use it after for carrying toys or whatever! Mini diaper bag even. Very pleased!', overall=5.0, summary='Love it!', unixReviewTime=1314230400, reviewTime='08 25, 2011'}
{reviewerID='A1XFBJEVJHPXZS', asin='1223070743', reviewerName='K. Murray', helpful=[0, 0], reviewText='These are really cute, for the pattern. I have bought a few of these to carry birthday presents for my kids friends. They are good for lightweight use, and the Star Wars design is adorable. But as far as grocery store use / everyday use, they are not that strong of bags. TRU sells them around $3-4 each and they are just about as good enough for carrying light stuff and toys, but no heavy use or day to day use here.', overall=3.0, summary='Cute design, but not good for long term use.', unixReviewTime=1361836800, reviewTime='02 26, 2013'}
{reviewerID='A1AMY1DS9LABCK', asin='1223070743', reviewerName='Mr.Bill', helpful=[0, 0], reviewText='Your typical reusable grocery store type bag. The art work is nice and the print is very clear. My son loves it.', overall=5.0, summary='Nice art work, very clear.', unixReviewTime=1361750400, reviewTime='02 25, 2013'}
{reviewerID='A1BWIKSK4HU3KQ', asin='1567120709', reviewerName='BRENT MULLEN', helpful=[0, 0], reviewText='I love my spell check. It is easy to use & works very well. I like the auto turn off so you dont run your battery out. The only drawback is that the buttons are very small. I would love to have the same product with bigger buttons. I would defiantly recommend this product.', overall=5.0, summary='spell check', unixReviewTime=1286668800, reviewTime='10 10, 2010'}
{reviewerID='A2FLTX6O3FF78H', asin='B004AHBBPW', reviewerName='K. Hamilton', helpful=[1, 1], reviewText='I love waking up each day to a bible verse.  You have the opportunity to save verses creating a type of "favorite list.". You can look up verses in full context and in different Bible versions.  There are other features, and the app works great on any phone I've ever had.', overall=5.0, summary='Terrific', unixReviewTime=1355875200, reviewTime='12 19, 2012'}
{reviewerID='A9KZXQ09LRRDQ', asin='1567120709', reviewerName='DIY'er "kenneth"', helpful=[15, 16], reviewText='a good multi-function product. it replaced a franklin spelling corrector i had  since 1989.i don't like the plastic case. it is very difficult to open. i broke a fingernail trying to open it.i purchased the new corrector because the characters were more readable than the older model's characters.', overall=4.0, summary='spelling corrector', unixReviewTime=1235779200, reviewTime='02 28, 2009'}
{reviewerID='AJVF3100286GE', asin='1567120709', reviewerName='Gary A. Olson', helpful=[0, 0], reviewText='It's a must for report writting. It has ten thousand words in it's data base. It's small and compact. Good price too.', overall=5.0, summary='Can't live without it', unixReviewTime=1346544000, reviewTime='09 2, 2012'}
{reviewerID='A1OP2Q163JD5TP', asin='B004AHBBPW', reviewerName='KINDLE NUT', helpful=[0, 0], reviewText='I have been trying to find a really good Bible plan. Well I did.  I listen with the audio and it is fantastic.  Finally something I know I will stick to. This plan gives me devotionals, preaching and Bible reading.  I can hardly wait until tomorrow for the next reading.  :-)', overall=5.0, summary='Great Bible Plan', unixReviewTime=1360800000, reviewTime='02 14, 2013'}
{reviewerID='A1IY2G9VO1JSVO', asin='1567120709', reviewerName='glory', helpful=[0, 2], reviewText='I did sloppy shopping. This machine is exactly what the name says it is - a speller. I wanted definitions, OH, that would be a dictionary! I ordered a dictionary an I am happy - except the voice is scratchy. Life is not perfect.gg', overall=1.0, summary='Sprelling Only', unixReviewTime=1357171200, reviewTime='01 3, 2013'}
{reviewerID='A2U47O0P6F27C2', asin='1567120709', reviewerName='Jack Limpet', helpful=[0, 0], reviewText='This was bought for my 3rd grader to use in class to check on some of the more tricky spellings--and it gets used a lot! It is not too big, not too small and the buttons are just right for small hands. It's quick to check things and it also stores all her friends' phone numbers, etc. The calculator is very useful too. Fun and easy to use, there are more and more of them appearing in the classroom now.', overall=5.0, summary='It's Amazing (says my 8 year old!)', unixReviewTime=1320624000, reviewTime='11 7, 2011'}
{reviewerID='A34UVV757IKPVB', asin='1567120709', reviewerName='justsomeguy', helpful=[0, 0], reviewText='I used to date this girl who loved Scrabble.  So, by association, I had to as well!  We used to play a lot - even with her Grandmother.  What they did, however, was "cheat".  We had one of these - this same Franklin Spelling Corrector you see here (an older model but same nonetheless) and you each of us was allowed to use it to come up with all kinds of crazy words.  I thought this was a dumb way to play Scrabble, at first, but then I came to love it.  If you're all "cheating", then it becomes a different game - the strategy changes.  We had a lot of fun.  Too bad I had to dump her for being utterly insane! (I'm sure she was bipolar-scitzophrenic or some variant thereof).  I kept the Franklin Spelling Corrector!  Still have it to this day!', overall=5.0, summary='I use it for Scrabble games.', unixReviewTime=1325808000, reviewTime='01 6, 2012'}
{reviewerID='A3VCEVGA8DWMF5', asin='B004AHBBPW', reviewerName='Lillian Genaux', helpful=[0, 0], reviewText='It's god work. enjoy not only able to read it but listen to the word too. Very good excellent book', overall=5.0, summary='Daily Bible', unixReviewTime=1360713600, reviewTime='02 13, 2013'}
{reviewerID='A21OA8773GTIKD', asin='1567120709', reviewerName='old dude', helpful=[0, 0], reviewText='Not good for large fingers. Demo must be cleared every time you turn it on. Slow if input is incorrect & may require a crazy input to get proper spelling. It does work however. Worth $15 or less.', overall=4.0, summary='Small', unixReviewTime=1337817600, reviewTime='05 24, 2012'}
{reviewerID='AKYDGCKCY7H9F', asin='1567120709', reviewerName='R. W. Milyard "GearJunky"', helpful=[4, 4], reviewText='The spell corrector does the job at a low cost, and does it far better than more expensive Franklin's.I don't see where age has anything to do with who uses this spell corrector.IT IS GOOD FOR ALL AGES!The only draw back is that you have to unscrew the back cover and pry itoff to replace the battery.', overall=5.0, summary='Does the job', unixReviewTime=1284163200, reviewTime='09 11, 2010'}
{reviewerID='A17G3Z19SV8DSW', asin='1567120709', reviewerName='Steven Zisk', helpful=[1, 1], reviewText='If you are a crossword addict you need this product.  The best on the market.Z', overall=5.0, summary='franklin spell checker', unixReviewTime=1212019200, reviewTime='05 29, 2008'}
{reviewerID='A3SPRSLV03DT6Y', asin='1567120709', reviewerName='t49y', helpful=[0, 0], reviewText='Marveling over this just arrived Spell Checker !! Three words already in less than twenty minutes !! Stylus or finger nails for this very light cell phone size cutie !! Quarter inch read out is way easy for the eye !! And to use too !! Starting, hopefully, into a happy future together !! Thank You !!!!', overall=5.0, summary='Tiny Fun', unixReviewTime=1347580800, reviewTime='09 14, 2012'}
{reviewerID='A2OA3NYSMBS1GM', asin='B004AHBBPW', reviewerName='M. Guru', helpful=[0, 0], reviewText='This app allows you to read the Bible, receive daily devtionals, and daily scriptures in the most commonly used Bible version (atleast by me) NLT, NKJV, and KJV. You also get to listen to podcast by today's leading ministries ex: Joyce Meyer, Joel Osteen, Charles Stanley and etc.', overall=5.0, summary='Awsome App', unixReviewTime=1361664000, reviewTime='02 24, 2013'}
{reviewerID='A3JB5HJUJBOCTP', asin='1567120709', reviewerName='TriciaJoh', helpful=[9, 9], reviewText='It works for my daughter, accurately finding words that she has no clue how to spell (e.g., "becuz" immediately found "because").  The one that arrived was black; she and I would have preferred the blue that was pictured.', overall=4.0, summary='Works great.', unixReviewTime=1222732800, reviewTime='09 30, 2008'}
{reviewerID='A37NMVKGPGPSA9', asin='1891747401', reviewerName='Allison "The Book Wheel"', helpful=[1, 1], reviewText='This was perfect for propping up textbooks so that I could take notes. This is a must-have for any student!', overall=5.0, summary='Great for my desk', unixReviewTime=1356739200, reviewTime='12 29, 2012'}
{reviewerID='AKU18EGFF6G02', asin='1891747401', reviewerName='Amazon Customer', helpful=[1, 2], reviewText='This book stand is highly adjustable and functional. It works great for most moderately sized hardcovers and paperbacks. For overtly thick professional books you may have to consider The Easi-Reader Bookstand which is much studier.', overall=4.0, summary='Adjustable and Functional', unixReviewTime=1266883200, reviewTime='02 23, 2010'}
{reviewerID='ACOM2CL2297RS', asin='B004AHBBPW', reviewerName='MrmsHaynes "Mr Ms Haynes"', helpful=[0, 0], reviewText='I love this app. I have no complaints, and I didnt have any complications with this app, very easy and simple to understand. I love reading the bible where ever I go.', overall=5.0, summary='Love it', unixReviewTime=1360540800, reviewTime='02 11, 2013'}
{reviewerID='A2KUNWFLNUU3Y7', asin='B004AHBBPW', reviewerName='nomadheart', helpful=[0, 0], reviewText='It's a good app. You do not need an internet connection to use it or to get the verse of the day, which is cool, but it would be nice if you could highlight (like you can a kindle book) but other than that, a good app.', overall=4.0, summary='good app, don't need an internet connection to get verse of the day, can't highlight though', unixReviewTime=1357776000, reviewTime='01 10, 2013'}
{reviewerID='A36K2N527TXXJN', asin='1891747401', reviewerName='Dr. Bojan Tunguz', helpful=[10, 10], reviewText='This is a very versatile book stand that is easy to carry around and easy to store. It is ideal for smaller books and for those readers who don't need variety of reading angles. However, it can accommodate larger books as long as you are a bit careful how you use it. In addition to books, it works really well with a variety of electronic book readers and the new generation of tablet computers. I've used it with myKindle Wireless Reading Device (6" Display, Global Wireless, Latest Generation)and iPad. In fact, when I was looking for an inexpensive way of propping up my iPad so that it doesn't lay flat on the table I settled for this option and so far it is working perfectly for me. In fact, I am writing this review on iPad that is propped up with it.The only problem that I have with it is the manufacturing quality. The first holder that I bought broke after a few months of use. I still went ahead and bought a new one because I feel that its many advantages far outweigh this shortcoming, and hopefully if I am a bit more careful with how I store it and handle it it may last longer this time around.', overall=4.0, summary='The no-frills book stand', unixReviewTime=1275177600, reviewTime='05 30, 2010'}
{reviewerID='A29DAEMSXWODX6', asin='B004AHBBPW', reviewerName='O G "oghennylo"', helpful=[2, 2], reviewText='I listen to this app all the time especially the devotions where you can listen to many great podcasts. It is very easy to use and recommend it highly', overall=5.0, summary='I use it daily', unixReviewTime=1324771200, reviewTime='12 25, 2011'}
{reviewerID='A3E1IXJ949VL29', asin='1891747401', reviewerName='JCR', helpful=[0, 0], reviewText='I'm very disappointed in this device. It's basically just a coat hanger with two plastic guides.  The only thing it has going for it is portability.  It can only hold regular sized hard covered books. Forget about any size paperback, it will not work. Even hard cover books are nearly impossible to align correctly and they slip and slump in all kinds of odd positions.  Then you have to completely remove the book from the stand every time you need to turn a page and try to realign it all over again.  I tried with over 10 textbooks and it didn't do well with any of them.  For home reading I'm going to buy and suggest you buy a more substantial stand. The only reason to keep it is to slip in a backpack and take with you and hope you have the desk space wherever you take it to use it.', overall=1.0, summary='It is basically just a coat hanger', unixReviewTime=1313452800, reviewTime='08 16, 2011'}
{reviewerID='A2DWN2MQYWKGNX', asin='B004AHBBPW', reviewerName='PinkieFairy', helpful=[0, 2], reviewText='The app is a good app however it was not good for what I needed the app for. It might wrk for other people's needs.', overall=3.0, summary='Daily Bible', unixReviewTime=1352073600, reviewTime='11 5, 2012'}
{reviewerID='A1QWT3B0YUE33U', asin='1891747401', reviewerName='Karlinha "Dog Lover"', helpful=[0, 0], reviewText='I bought one for myself and everybody that sees it loves it.  I love it too.  It's very light and easy to carry around.  I like mine so much, I bought extra ones to give as Christmas present to my mom and other family members.', overall=5.0, summary='Great little book holder', unixReviewTime=1351814400, reviewTime='11 2, 2012'}
{reviewerID='A5SICA8R9FRKH', asin='B004AHBBPW', reviewerName='punk360', helpful=[0, 0], reviewText='I so love this app.I have been looking for a book that will help me memorize Bible verses easily without having to look at a page full of words. I give this app 5 stars easily.', overall=5.0, summary='love it', unixReviewTime=1342310400, reviewTime='07 15, 2012'}
{reviewerID='A30PY2LKV83CKX', asin='B004AHBBPW', reviewerName='Railfarmer', helpful=[0, 0], reviewText='I was looking for an app to help me with my annual &#34;read through the Bible in a year&#34; and this app is perfect.  I really like the way it offers several different plans (since I like to do it a different way each year).  Plus with this app there are daily messages (in your choice of lots of translations!), and practically all of it can be read aloud to you.  This is an excellent Bible app.', overall=5.0, summary='This has it all', unixReviewTime=1358640000, reviewTime='01 20, 2013'}
{reviewerID='A7X8EPSXRJTK2', asin='B004AHBBPW', reviewerName='RAS', helpful=[0, 0], reviewText='There are so many different options. You can read a verse or listen to a podcast or even just read the Bible. Looking up verses is a cinch. There is also an option for audio. Great app,  just genius!!!!!', overall=5.0, summary='Best daily devotion ever!!!!', unixReviewTime=1334880000, reviewTime='04 20, 2012'}
{reviewerID='AF8SREA2XE7BJ', asin='1891747401', reviewerName='M. Karazim', helpful=[1, 1], reviewText='I use this for everything from propping up cookbooks in the kitchen to reading hardcovers at my desk while eating my lunch.  Most recently I've been using it for my Kindle 2.  Works great for everything, but a little tricky for some paperbacks because they slip around a little bit.  It does work best with the average-sized hardcover (think novel- sized).  Folds up nice and fits well in a drawer or in the front pocket of my backpack.  Definitely a handy thing to have around.', overall=5.0, summary='Love This', unixReviewTime=1263772800, reviewTime='01 18, 2010'}
{reviewerID='A2O4BRCQ3CM9UI', asin='1891747401', reviewerName='SDNY', helpful=[0, 0], reviewText='This is a really convenient book stand if you like to read outside of home and don't have larger books. If you don't necessarily need the portability or if you have large/tall textbooks I would suggest you look at something more study as this tends to tip over/make indentations on the bottom of pages for those books. Also you can increase the height of the stand by pulling  up part of the metal frame, but even with doing this it doesn't really support larger books well enough to easily highlight.', overall=3.0, summary='Good for certain things', unixReviewTime=1357430400, reviewTime='01 6, 2013'}
{reviewerID='A1RSANUDWRO7RB', asin='B004AHBBPW', reviewerName='Ryan DeMesa', helpful=[3, 6], reviewText='this app works great. u can schedule it to give u one inspirational verse per day as well as choose what translation u want showing on the widget.', overall=5.0, summary='ignore those who rate this app one star to simply hate and bash religion. this app is great.', unixReviewTime=1300752000, reviewTime='03 22, 2011'}
{reviewerID='A1OO6NIYPAZHH4', asin='B004AHBBPW', reviewerName='sonidorm', helpful=[0, 0], reviewText='I am really enjoying this app.  I like the daily plan as it covers passages from different books; also the devotional podcasts. This is my third Bible app. and I put this at the top of the list.Recommend it to everyone', overall=5.0, summary='Daily Bible', unixReviewTime=1353801600, reviewTime='11 25, 2012'}
{reviewerID='A26EFYSDYDW92O', asin='B004AHBBPW', reviewerName='Talya', helpful=[0, 0], reviewText='This app was awesome, but the Daily Plan went blank, and has not been fixed. it doesn't matter which plan you are on. I tried going to the website, but joansoft.com is totally down. Looks like the domain may have expired. Does that mean things won't get fixed? Help!', overall=3.0, summary='Please fix!', unixReviewTime=1336521600, reviewTime='05 9, 2012'}
{reviewerID='A1SNMKC1836UOU', asin='2042037265', reviewerName='Kira's mom', helpful=[0, 0], reviewText='This is as described but for some reason, I was still expecting it to be a little larger. I purchased it with the intention of using it when making my daughter's lunch - cutting cheese slices, sandwiches, cucumbers, etc.  It's the perfect size for what I wanted.  You could also use it as a form for making pancakes, etc but they would be very small!  I wouldn't use it as a cookie cutter but my family makes double the size of the average cookie.  Maybe for mini cookies this would work...', overall=4.0, summary='Cute', unixReviewTime=1356566400, reviewTime='12 27, 2012'}
{reviewerID='A2WT86IPK92CM0', asin='B004AHBBPW', reviewerName='Thomas Adams', helpful=[2, 2], reviewText='first thing I would like to do is to thank amazon for putting the Bible and Christian readings on the amazon fire.ienjoy the daily Bible because of the daily readings. everyone should have it installed on their kindle fire .thanks Tommy adams', overall=5.0, summary='daily bible', unixReviewTime=1327449600, reviewTime='01 25, 2012'}
{reviewerID='A3K8FTCAR8DKWI', asin='2042037265', reviewerName='Marleenandlouie', helpful=[0, 0], reviewText='I like this.  It's a little small but  that's OK (keeps  one from overeating too many cookies.  Seems very solid and Ithink it will last. Came faster then  they said it would.', overall=4.0, summary='cute', unixReviewTime=1354752000, reviewTime='12 6, 2012'}
{reviewerID='A3SYH6T1DZ65FT', asin='2042037265', reviewerName='Robyn Hidalgo "robyn"', helpful=[0, 0], reviewText='so cute but super small. Just pay close attention to the measurment. Have not yet used it but the cookies are sure to be micro.', overall=5.0, summary='adorable', unixReviewTime=1355616000, reviewTime='12 16, 2012'}
{reviewerID='ARWZZLVUNPODY', asin='7213035835', reviewerName='Anna', helpful=[1, 1], reviewText='I really like these ice trays, because they for one have a cover and therefore prevents any freezer odors from getting in. Also, they stack nicely on top of one another. Another thing I like is the Purple color lids. I would definitely recommend these to my friends.', overall=5.0, summary='no smell', unixReviewTime=1328227200, reviewTime='02 3, 2012'}
{reviewerID='A3CCGSJQF6SPQU', asin='B004AHBBPW', reviewerName='tonize', helpful=[0, 0], reviewText='I love this app. It was one of the first I downloaded on my tablet. The many versions and ease of use are super. The best feature I love are the audio devotions.', overall=5.0, summary='Love it!!!!!!!', unixReviewTime=1341705600, reviewTime='07 8, 2012'}
{reviewerID='A2GYRJEYXFK9L2', asin='B004AHBBPW', reviewerName='Tony T', helpful=[0, 0], reviewText='I like this app a lot Thanks for being here.Hope it helps you as much ss it helps me.', overall=5.0, summary='Great app', unixReviewTime=1341532800, reviewTime='07 6, 2012'}
{reviewerID='AAQBH9OEFJANU', asin='7213035835', reviewerName='Harry', helpful=[4, 4], reviewText='I don't use many ice cubes, and they would evaporate form the tray before I used any. But every once in a while I do need some, and they would be gone.With the tops on these trays, the ice cubes last many times longer. Maybe two years or more.', overall=4.0, summary='What I was looking for.', unixReviewTime=1331164800, reviewTime='03 8, 2012'}
{reviewerID='AGNAXU1MGQMVO', asin='B004AHBBPW', reviewerName='very fun', helpful=[0, 0], reviewText='the best mobile Bible app that I could find.I love it. You can listen to a devotional.Please download it now.', overall=5.0, summary='download it now  God will speak to you!', unixReviewTime=1345507200, reviewTime='08 21, 2012'}
{reviewerID='AM5SR2FJ6QA84', asin='7213035835', reviewerName='R. Edwards "quality and value sleuth"', helpful=[1, 1], reviewText='Finally...ice cube trays with covers that really work! These are great...there's nothing like fresh, clean, great tasting ice! I...like many other reviewers do not use the pop top to fill these, I find it's easier to fill these the old fashioned way. They do work very well and a little water on the bottom pops them right out! A great product!', overall=5.0, summary='FANTASTIC!', unixReviewTime=1314576000, reviewTime='08 29, 2011'}
{reviewerID='AG4WP51O5MORV', asin='B004AHBBPW', reviewerName='Wesley Irvin', helpful=[0, 1], reviewText='I was really surprised by this product. You basically get to read a line a day and navigation is very very very very very very hard. Maybe God can figure it out.', overall=3.0, summary='Hard to read', unixReviewTime=1324771200, reviewTime='12 25, 2011'}
{reviewerID='A1F4HI4AFD717C', asin='B004AHBBPW', reviewerName='Western Ink', helpful=[0, 0], reviewText='Daily Bible verse.  I love this, it pops up every morning, its searchable, and you can save your favorite verses.', overall=5.0, summary='Very useful.', unixReviewTime=1354665600, reviewTime='12 5, 2012'}
{reviewerID='A1G7V574BEAWP0', asin='B004AHBBPW', reviewerName='whitley', helpful=[0, 0], reviewText='It just helps me feel closer to the lord so I love who made this app :)thanks to God I am here today', overall=5.0, summary='lord', unixReviewTime=1334707200, reviewTime='04 18, 2012'}
{reviewerID='A17OBSRG07AH95', asin='7502151168', reviewerName='Amazon Customer "fresh_bread"', helpful=[1, 1], reviewText='I prefer these citrus peelers to using a knife to peel oranges and grapefruit. It's safer and easier to pack in a lunchbox. These disappear in my house the way socks do, so I'm glad to have a half dozen of them.', overall=5.0, summary='So handy', unixReviewTime=1357862400, reviewTime='01 11, 2013'}
{reviewerID='A1LAKJABWORN3B', asin='B004AHBBPW', reviewerName='y', helpful=[0, 7], reviewText='didn't like this app at all I dnt receive anything I instantly uninstalled. i expected the best from this App and didn't get it', overall=1.0, summary='didnt like', unixReviewTime=1340323200, reviewTime='06 22, 2012'}
{reviewerID='ATVPFGJ60CTGP', asin='7502151168', reviewerName='B. Services', helpful=[1, 1], reviewText='i'm 40 and i remember my mom having one of these.  it was a very stiff plastic.  these are very "bendy".  probably will search for something else.', overall=3.0, summary='too young to be talking about the good old days', unixReviewTime=1329868800, reviewTime='02 22, 2012'}
{reviewerID='A33TE1GSOTT6J4', asin='B004ALVL6W', reviewerName='al5x', helpful=[1, 2], reviewText='I get the point of it, but its just the fact that there is no tutorial.  they tell you what to do but it is.not clear', overall=3.0, summary='i dunno', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A3H0Y8PUSM761Y', asin='B004ALVL6W', reviewerName='Amazon Customer', helpful=[0, 0], reviewText='Overall, a pretty well made tower defense game. I found it to be quite fun, if a bit too easy on the easy settings.Things that aren't in the instructions that people can't seem to figure out on their own:You place power station towers to recharge your towers. 3 were sufficient for me to beat the first level.When placing a tower, you tap the location you want it, and then you can drag your finger around anywhere on the screen to fine-tune the placement. Quite brilliant, that; it solves the problem of trying to carefully place the tower while it's under your thumb.Enemies come from left to right on the first level. I assumed the opposite, due to the background graphic.Overall, a pretty solid game. Runs well, no crashes, no lockups, freezes, or any other negative events. Graphics are suitable to what you would expect from a bubble popping TD game.-1 star for poor instructions, not that it wasn't hard to figure out; very easy, simple game.EVO 3D, FAOTD.', overall=4.0, summary='Good game, needs better instructions', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A3GCQI2M5ZIIV8', asin='B004ALVL6W', reviewerName='ANGELA', helpful=[1, 2], reviewText='this game is easy to understand its like tower defense but the controls are impossible so not worth it even as a freebie what a waste.', overall=1.0, summary='this game stinks', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A20RNI00FS9FUP', asin='7502151168', reviewerName='E. Atteberry', helpful=[0, 0], reviewText='These are great - like we used to get at parties but different colors. These are handy items so I was glad to find them. They were a fun item for our Christmas stockings.', overall=5.0, summary='Citrus Peelers', unixReviewTime=1361923200, reviewTime='02 27, 2013'}
{reviewerID='A1REBB7PBA8A0W', asin='B004ALVL6W', reviewerName='A. Norlem', helpful=[0, 1], reviewText='It's a tower defense game. I like the twist of the energy towers. It doesn't have beautiful, intense graphics but doesn't need them. Most of the low ratings are from trolls or people incapable or too lazy to read the instructions. I took off one star due to price. If it hadn't been a FAOTD the current cost is too high.', overall=4.0, summary='Ignore poor ratings', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A3D6NQ007JSVJI', asin='B004ALVL6W', reviewerName='app free', helpful=[1, 2], reviewText='The towers take forever to move, the instructions are in a very inconvenient place, and the towers can't keep up with the circles. On level one in the easiest setting I got a tower and it couldn't keep up with the circles so the game is basically impossible. Uninstalled right away, not worth the money, DO NOT GET!', overall=1.0, summary='What kind of game is this?', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A22H29YDXDYAAG', asin='B004ALVL6W', reviewerName='A. Shanno', helpful=[0, 0], reviewText='Can only play about 5 minutes and then forces closed. It's a fun game, just frustrating that in the middle of a round, forces close. Please update and fix. Motorola Defy Android 2.2', overall=2.0, summary='Issues', unixReviewTime=1332892800, reviewTime='03 28, 2012'}
{reviewerID='A3F60HB8AJJPO3', asin='B004ALVL6W', reviewerName='awesum waffles', helpful=[0, 1], reviewText='this game is great now that its free and yes there are some issues that can be fixed but if you don't want to pay three bucks for it then get it while its free now.', overall=4.0, summary='bubbles', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A14O2ZUKQQFDU8', asin='B004ALVL6W', reviewerName='BigMacM4ster', helpful=[2, 4], reviewText='I just tried this game and the towers need to recharge but I have no idea how to do that I literary tried everybutton then I even went to help and all it all it said was they will need to be recharged so I folly don't reccomend this.', overall=1.0, summary='dont waste ur time', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A1CFZH0IZ00H51', asin='B004ALVL6W', reviewerName='BMT', helpful=[0, 0], reviewText='Among the Android tower defense games this sets itself apart pretty well with the concept of power requirements and mobs that fight back but everything about this game feels like it was half assed. Not least among the issues is the horrible UI that I can safely say is the worse I have ever seen on a mobile phone game. If you got it for free from Amazon might be worth setting down with for a few minutes but I could never justify to myself spending any money for it.', overall=2.0, summary='Some unique concepts but poor execution across the board.', unixReviewTime=1331683200, reviewTime='03 14, 2012'}
{reviewerID='A3N3TRD4YGTKUY', asin='7535549756', reviewerName='David J. Morse "Darkgoth"', helpful=[0, 2], reviewText='this item was ok just as I expected I wish you didnt have to comment here on every thing, one two three four five six seven', overall=5.0, summary='pill boxes good for', unixReviewTime=1324944000, reviewTime='12 27, 2011'}
{reviewerID='ASQAKM368A8UL', asin='B004ALVL6W', reviewerName='Brian', helpful=[1, 2], reviewText='This app is about how people fight bubbles of water while flying in air balloons.... ? seriously this app just fails in every direction, the concept of gameplay is unappealing and shamefull, graphics sucks, and did I mention that there's no music? :D am destroying this app to rubble, 1 star for faotd again.... you mad bro? good be mad hahaha', overall=1.0, summary='More like rubble defense 2!', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A1HDDJMKB2G5KC', asin='7535549756', reviewerName='D. Barker', helpful=[1, 1], reviewText='These do what I expect them to do, which is to provide an excellent seal and be durable. A little pricey but can't argue for the quality.', overall=5.0, summary='good containers', unixReviewTime=1352678400, reviewTime='11 12, 2012'}
{reviewerID='A35E664EM4CDUS', asin='B004ALVL6W', reviewerName='Brian Lawrence', helpful=[1, 2], reviewText='I would at least assume they had some experience with app. development considering this is the second game in a hopefully 2 part series. But it's obvious they don't learn from their mistakes.. time to stop trying, Maribou inc. I feel sorry for the poor S.O.B.s that shelled out three bucks for this.', overall=1.0, summary='Wow...', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='AWPOWZJNQ2PHH', asin='B004ALVL6W', reviewerName='Brian McGrath the Carny', helpful=[1, 3], reviewText='greetings fellow amazonians from here at the Nashville city holding cell. this is not where I live, but I was extradited to here because a previous public nudity charge.anywho I was here and pretty bored so I looked up the faotd. I was a little worried that bubble defense 2 was not good to download and play in jail, but boy was I wrong. even though the game is a little lame the guys here don't care. some of them have been sitting here since the first. iphone came out and didn't know that this stuff exists. what was great I could use this game as a new currency which is really making my stay here pretty nice. thanks amazon for making my stay in jail an enjoyable one!', overall=4.0, summary='kept me safe in prison', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='AAL9I57IV5M6F', asin='B004ALVL6W', reviewerName='Buckleysmom', helpful=[0, 1], reviewText='At first I  didn't  think  it was working  right on my K Fire. I couldn't  drag the towers, but once I figured out how to place them (just tap where u want them) things were fine. I only give it 4 stars because the graphics could be lots better.', overall=4.0, summary='Ok after a bit....', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A3CMLI1QXWEKRP', asin='7535549756', reviewerName='feelingalittlelunchy dotcom', helpful=[1, 1], reviewText='I had looked high and low for a 1 ounce souffle cup and lid set for our lunchboxes.  The only ones I could find were disposable, and I strive to make our lunches completely trash free.  (See some of my other reviews)The Smidgets are the perfect size for salad dressings, little candy treats or marshmallows, raisins, nuts...if it's little, it flies!  You'll love them.  I followed the tip from another Amazon reviewer and boiled them for 1 minute then re-sealed them while they are still hot to make the lids easier to take on and off.  Worked like a charm.', overall=5.0, summary='Perfect size for the kids lunchboxes', unixReviewTime=1313193600, reviewTime='08 13, 2011'}
{reviewerID='A1I6R07JV6D762', asin='B004ALVL6W', reviewerName='C. Buchanan', helpful=[2, 4], reviewText='Never been speechless, but this is how this game leaves me unfortunately. Maybe by version 10 it will get better? I hope so.', overall=1.0, summary='wow. WOW!', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='AV15W3FPLQPN0', asin='7535549756', reviewerName='MikeDidIt "Have a GREAT One!"', helpful=[0, 0], reviewText='I take vitamins. Most containers aren't big enough to hold them. These are perfect.* They have plenty of room - I don't have to methodically arrange my vitamins to allow the lid to close. I estimate these will hold around 20 big vitamins. 9/9/11 Update: I just attached an image showing this with 16 vitamins. I think it would hold 20 if you work at it. With 16, I can just drop them in and pop the lid on.* They are compact enough to fit into a jeans pocket.Yep, the lid is hard to get off the first couple of times. No worries after that. The bonus is that a snug lid means I don't worry about them opening and spilling my vitamins. Nice!My daughter loves these in her purse, too.The uses are practically endless (aspirin, gum, paper clips, skittles :)HIGHLY Recommended!', overall=5.0, summary='Perfect for vitamins, etc.', unixReviewTime=1314748800, reviewTime='08 31, 2011'}
{reviewerID='A10NBG7OM8KV1R', asin='7802215811', reviewerName='Amazon Customer', helpful=[1, 1], reviewText='My Kids love pickles. With this container they can get them any time and I don't have to worry about them dropping the glass jar. There isn't juice splattered. It's great to carry on picnics or to the lake.', overall=5.0, summary='Kathy from SC', unixReviewTime=1333497600, reviewTime='04 4, 2012'}
{reviewerID='ASBT4A6GH7633', asin='B004ALVL6W', reviewerName='cd22067', helpful=[0, 2], reviewText='this is by far the best game on android, beats angry birds, plants &amp; zombies,any EA game, any Eloft game, cut the rope...got sarcasm?', overall=5.0, summary='BEST GAME EVER!!!', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A1AS2TICJAA486', asin='7802215811', reviewerName='carleen70', helpful=[2, 3], reviewText='very convenient, draining feature is great & goodcapacity. if only it wasn't colored so you could see the contents a little better & know what wasin there. i have a bunch of these in my fridge, & it's always trial and error findng the olives, pickles, sundried tomatoes  artichokes. i get there in the end, but if you could see the contents better, cooking would be faster!', overall=4.0, summary='great item', unixReviewTime=1327363200, reviewTime='01 24, 2012'}
{reviewerID='A1SJ9F5ZJ3IHG', asin='B004ALVL6W', reviewerName='Chris Goss', helpful=[0, 1], reviewText='Fun game while it lasts, but it FCs all the time with no rhyme or reason on my A500.  The only saving grace is that it sort of saves your game just before it blitzes (except for the 1 time it destroyed all my towers upon reload).  If the FC gets fixed, I'll up the stars.  It's not bad enough for 1 star, but the FCs keep it a solid 2.  Other than that, it would be a 5.', overall=2.0, summary='Force Close: A500', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='AEJX5GRBJ4B8V', asin='7802215811', reviewerName='Cat Owner', helpful=[0, 0], reviewText='No more using silverware and/or fingers to get pickles out of the jar!  This 8 cup container by Tupperware is very durable!  It'll hold an entire 64oz jar of pickles!  I absolutely love this container!', overall=5.0, summary='Great Product!! :D', unixReviewTime=1309910400, reviewTime='07 6, 2011'}
{reviewerID='A1100C3R2540RS', asin='B004ALVL6W', reviewerName='Christine "The Siren"', helpful=[1, 2], reviewText='Touch response is nonexistent. Instructions are very little help. Good thing I got it as a free app, I would be demanding my money back with how much this game normally costs.', overall=1.0, summary='Ugh', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A3MG86I2SHKMJZ', asin='7802215811', reviewerName='cher bear', helpful=[1, 1], reviewText='I remember my mom having one of these when I was a child - over 35+ years ago! I knew what I wanted and was THRILLED to have found the EXACT product I desired at a price that was reasonable. The color isn't important but function is. It holds jalepeno peppers and make it easy to access them - 'cause the jars are not user friendly!', overall=4.0, summary='WHAT I WANTED', unixReviewTime=1362009600, reviewTime='02 28, 2013'}
{reviewerID='A1R5P8WWB99CUP', asin='B004ALVL6W', reviewerName='clutch5776', helpful=[0, 1], reviewText='I played the first bubble defense game from the other market, and and enjoyed it. I admit this pales in comparison to Jelly Defense, but this is a solid game.', overall=5.0, summary='Solid TD game.', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A3VKU025MJPLT0', asin='B004ALVL6W', reviewerName='cookie .R', helpful=[1, 4], reviewText='It sucks!!The weapons are stuped.Don,t wast your time and your money.Who came up with this game is stuped. Get a life.', overall=1.0, summary='Horrible Game', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A1QVG6MJG6Z43Y', asin='B004ALVL6W', reviewerName='Daniel Stidham', helpful=[0, 0], reviewText='Ended up removing this game from my phone.  It wasn't fun and I couldn't figure out how to make the "cannon" fire more than once at a target. At least it was free.', overall=1.0, summary='No fun', unixReviewTime=1336608000, reviewTime='05 10, 2012'}
{reviewerID='A2F1INWG8T2S65', asin='7802215811', reviewerName='muffy', helpful=[0, 0], reviewText='HAD ONE OF THESE FOR YEARS AND LOVED IT; LOST IT SOMEWHERE, AND DIDN'T REALIZE HOW MUCH I MISSED USING IT;MAKES SERVING PICKLES SO MUCH EASIER AND NO MESS;PRODUCT IS VERY WELL MADE AND SO STURDY; SUCH A WELCOME ADDITION TO MY KITCHEN;', overall=5.0, summary='GREAT ITEM', unixReviewTime=1308960000, reviewTime='06 25, 2011'}
{reviewerID='ABFSAHVOCOUEW', asin='B004ALVL6W', reviewerName='Divade', helpful=[1, 2], reviewText='it is a tower defends game, but its basic, it doesn't tell you what each tower does, and there is no pause or restart. not bad once you know it, bit gives a terrible first impression by mot helping the player learn to play.', overall=2.0, summary='works, but...', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='AB96SUX4J7KRE', asin='B004ALVL6W', reviewerName='Donna', helpful=[0, 0], reviewText='I don't know how long I've been playing it for, but I got it as the Free App of the Day a while ago. I play it everyday, multiple times a day. Like others who have it a 1 star review I also like Jelly Defense and Plants vs Zombies; while the graphics may not be as good as those other games, I'm getting much more play time out of this. Jelly Defense took me a while to finish and was worth it (if I had paid for it, another Free App of Day), this one is taking me much much longer to finish.  I'd rather the graphics be lacking if the game can be played for many weeks, or more?I'm addicted to it. I just wish I knew a little more about how certain things work, I'm trying to figure these out. Like I recently learned upgrading the power stations is very important, not just buying more. Upgrade everything.Sometimes I notice a tower right next to a power station let all the things go by without shooting at any of them, I'd like to know what I'm doing wrong when that happens, but that's rare. Also I want to know what it means when a tower has that little power graphic flash or sometimes just stay solid. Does it mean it needs power? Like it wants to shoot but can't at the moment?So other than a wanting a few more instructions, I love the game. Even with the things I can't seem to figure out, it still gets 5 stars.I'm surprised by all the low ratings here and wonder if it's mostly people who dont like or know how to play defense games.I wish people would realize they should rate on the quality of the app, not on whether it's their type of app. The low ratings hurt the developer and cause them to sell less games.If you like defense games get it, if I was suddenly forced to pay for it now, I would definitely buy it, because after a few weeks of playing I have lots of play-time left. Actually, I think I'll end up moving on to a new game before ever finishing all these levels.', overall=5.0, summary='Love it', unixReviewTime=1334361600, reviewTime='04 14, 2012'}
{reviewerID='AMKOB8PYXKJCS', asin='B004ALVL6W', reviewerName='D. Trees', helpful=[7, 10], reviewText='unfortunately this is one of those games that was &quot;good&quot; on blackberrys because the java based crapOS ment this.game was top of the line. coming to android will be a.different story, but the game it self was fun when I played it on the storm. The closest thing I can compare it too is Bloon TD 1or2. luckly 4 is on one or more android stores. Would recomend spending 1$ on that over this anyday. To all BB devs... either step up your game or go down with the dieing BB ship.', overall=3.0, summary='It's a blackberry port...', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A3VBKMQ25VSTJV', asin='9177124405', reviewerName='HRH Spider "Cats   ^..^"', helpful=[6, 6], reviewText='yes overpriced perhaps at amazon.  off course its cheap but they work.  i  spend less money on flatware and it gives me more money to buy food and cram in my mouth. i like it', overall=3.0, summary='cheap', unixReviewTime=1349654400, reviewTime='10 8, 2012'}
{reviewerID='A2N7D92C9TIJXV', asin='B004ALVL6W', reviewerName='Fears', helpful=[0, 1], reviewText='Despite many of the other reviews I gave it a shot. It's pretty fun on my Kindle Fire. Don't know why so many people are being harsh. Give it a try if you like tower defense games.', overall=4.0, summary='Pretty fun.', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
{reviewerID='A25GRYSE0YNRVC', asin='B004ALVL6W', reviewerName='Felix', helpful=[0, 1], reviewText='This is the first tower defense (TD) game i've played and it's an enjoyable game.  Most of the negatiave reviews are from people that don't understand the concept and were to lazy to try to understand...or perhaps just trolling, big surprise.  The initial towers you can purchase shoot once.  As you earn more coins you can upgrade to better towers, power stations etc.  Anyways, the game looks simple in appearance, but again it's just a simple TD game for your phone.  The two things i don't like were the instructions didn't mention that you can upgrade during waves, not just between waves.  Also, I couldn't slide towers across my screen.  I could only move them by touching the spot on my screen where i'd want them.  This was tedious at times because the tip of your finger isn't as accurate as if you were using a stylus.  Sliding would have been much easier.  HTC Thunderbolt stock.', overall=4.0, summary='This is a GOOD game.', unixReviewTime=1331424000, reviewTime='03 11, 2012'}
